const products = {
       phones: {
              iphone: [
                     {
                            id: 1,
                            cardName: 'گوشی موبایل اپل مدل iPhone 13 Pro Max A2644',
                            name: 'گوشی موبایل اپل مدل iPhone 13 Pro Max A2644 دو سیم‌ کارت ظرفیت 128 گیگابایت و رم 6 گیگابایت - اکتیو',
                            colors: ['lightskyblue', 'gray'],
                            price: 89000000,
                            rate: 4.5,
                            comments: [
                                   {
                                          title: 'آیفون فوق العادس تو استفاده دراز مدت ، اینو من نسخه ۲۵۶ رو دارم خیلی راضی هستم. ولی کاش دیگه همرو با حافظه ۵۱۲یا یک ترا بززن، آخه صدو بیست هشت، واقعا اختلاف قیمت زیادی داره ، و خیلی ها مجبورن از ۱۲۸ بخواطر بودجه شون بگیرن،',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Super Retina XDR OLED' },
                                   { title: 'اندازه', subTitle: '6.7' },
                                   { title: 'رزولوشن عکس', subTitle: '12 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'iOS 15' }
                            ],
                            moreInfo: {
                                   title: 'آیفون 13 پرو مکس تا دندان مسلح',
                                   text: 'گوشی‌های هوشمند خانواده آیفون 13 در قالب چهار گوشی هوشمند آیفون 13 پرو مکس، آیفون 13 پرو، آیفون 13‌ و آیفون 13 مینی معرفی شدند. پرچمداران جدید اپل این بار قدرتمند‌تر از همیشه پا به عرصه رقابت گذاشته اند تا در رقابتی بسیار جذاب، عملکردی بهتر به نسبت پرچمداران اندرویدی به نمایش بگذارد. از جمله اصلی‌ترین تغییرات در نظر گرفته شده برای این گوشی های هوشمند در مقایسه با پرچمداران خانواده آیفون 12 می‌توانیم به سنسور‌های دوربین قدرتمند‌تر، پردازنده فوق العاده با عملکرد بهتر و خیره کننده به نسبت نسل قبلی، تنوع رنگی بالا، صفحه نمایش به‌مراتب با‌کیفیت‌تراشاره کنیم. در این بررسی به‌سراغ آیفون 13 پرو مکس به عنوان گل سرسبد گوشی های هوشمند این خانواده رفته ایم تا ببینیم چه مشخصاتی را با خودش به همراه داشته و به نسبت آیفون 12 پرو مکس چه تغییرات در مشخصات فنی در نظر گرفته شده دارد.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۱۶۰.۸x۷۸.۱x۷.۷' },
                                   { title: 'وزن', subtitle: '۲۴۰ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Super Retina XDR OLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات سیم کارت', subtitle: 'سایز نانو (۸.۸ × ۱۲.۳ میلی‌متر)' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 2,
                            cardName: 'گوشی موبایل اپل مدل iPhone 11 ZPA',
                            name: 'گوشی موبایل اپل مدل iPhone 11 ZPA تک سیم‌ کارت ظرفیت 128 گیگابایت و رم 4 گیگابایت',
                            colors: ['white'],
                            price: 28413000,
                            rate: 4.4,
                            comments: [
                                   {
                                          title: 'آیفون فوق العادس تو استفاده دراز مدت ، اینو من نسخه ۲۵۶ رو دارم خیلی راضی هستم. ولی کاش دیگه همرو با حافظه ۵۱۲یا یک ترا بززن، آخه صدو بیست هشت، واقعا اختلاف قیمت زیادی داره ، و خیلی ها مجبورن از ۱۲۸ بخواطر بودجه شون بگیرن،',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Super Retina XDR OLED' },
                                   { title: 'اندازه', subTitle: '6.7' },
                                   { title: 'رزولوشن عکس', subTitle: '12 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'iOS 15' }
                            ],
                            moreInfo: {
                                   title: 'آیفون 13 پرو مکس تا دندان مسلح',
                                   text: 'گوشی‌های هوشمند خانواده آیفون 13 در قالب چهار گوشی هوشمند آیفون 13 پرو مکس، آیفون 13 پرو، آیفون 13‌ و آیفون 13 مینی معرفی شدند. پرچمداران جدید اپل این بار قدرتمند‌تر از همیشه پا به عرصه رقابت گذاشته اند تا در رقابتی بسیار جذاب، عملکردی بهتر به نسبت پرچمداران اندرویدی به نمایش بگذارد. از جمله اصلی‌ترین تغییرات در نظر گرفته شده برای این گوشی های هوشمند در مقایسه با پرچمداران خانواده آیفون 12 می‌توانیم به سنسور‌های دوربین قدرتمند‌تر، پردازنده فوق العاده با عملکرد بهتر و خیره کننده به نسبت نسل قبلی، تنوع رنگی بالا، صفحه نمایش به‌مراتب با‌کیفیت‌تراشاره کنیم. در این بررسی به‌سراغ آیفون 13 پرو مکس به عنوان گل سرسبد گوشی های هوشمند این خانواده رفته ایم تا ببینیم چه مشخصاتی را با خودش به همراه داشته و به نسبت آیفون 12 پرو مکس چه تغییرات در مشخصات فنی در نظر گرفته شده دارد.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۱۶۰.۸x۷۸.۱x۷.۷' },
                                   { title: 'وزن', subtitle: '۲۴۰ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Super Retina XDR OLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات سیم کارت', subtitle: 'سایز نانو (۸.۸ × ۱۲.۳ میلی‌متر)' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 3,
                            cardName: 'گوشی موبایل اپل مدل iPhone 13 Pro Max',
                            name: 'گوشی موبایل اپل مدل iPhone 13 Pro Max تک سیم‌ کارت ظرفیت یک ترابایت و رم 6 گیگابایت - اروپا نات اکتیو',
                            colors: ['gray', 'lightseagreen', 'gold', 'lightskyblue'],
                            price: 95000000,
                            rate: 5,
                            comments: [
                                   {
                                          title: 'آیفون فوق العادس تو استفاده دراز مدت ، اینو من نسخه ۲۵۶ رو دارم خیلی راضی هستم. ولی کاش دیگه همرو با حافظه ۵۱۲یا یک ترا بززن، آخه صدو بیست هشت، واقعا اختلاف قیمت زیادی داره ، و خیلی ها مجبورن از ۱۲۸ بخواطر بودجه شون بگیرن،',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Super Retina XDR OLED' },
                                   { title: 'اندازه', subTitle: '6.7' },
                                   { title: 'رزولوشن عکس', subTitle: '12 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'iOS 15' }
                            ],
                            moreInfo: {
                                   title: 'آیفون 13 پرو مکس تا دندان مسلح',
                                   text: 'گوشی‌های هوشمند خانواده آیفون 13 در قالب چهار گوشی هوشمند آیفون 13 پرو مکس، آیفون 13 پرو، آیفون 13‌ و آیفون 13 مینی معرفی شدند. پرچمداران جدید اپل این بار قدرتمند‌تر از همیشه پا به عرصه رقابت گذاشته اند تا در رقابتی بسیار جذاب، عملکردی بهتر به نسبت پرچمداران اندرویدی به نمایش بگذارد. از جمله اصلی‌ترین تغییرات در نظر گرفته شده برای این گوشی های هوشمند در مقایسه با پرچمداران خانواده آیفون 12 می‌توانیم به سنسور‌های دوربین قدرتمند‌تر، پردازنده فوق العاده با عملکرد بهتر و خیره کننده به نسبت نسل قبلی، تنوع رنگی بالا، صفحه نمایش به‌مراتب با‌کیفیت‌تراشاره کنیم. در این بررسی به‌سراغ آیفون 13 پرو مکس به عنوان گل سرسبد گوشی های هوشمند این خانواده رفته ایم تا ببینیم چه مشخصاتی را با خودش به همراه داشته و به نسبت آیفون 12 پرو مکس چه تغییرات در مشخصات فنی در نظر گرفته شده دارد.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۱۶۰.۸x۷۸.۱x۷.۷' },
                                   { title: 'وزن', subtitle: '۲۴۰ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Super Retina XDR OLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات سیم کارت', subtitle: 'سایز نانو (۸.۸ × ۱۲.۳ میلی‌متر)' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 4,
                            cardName: 'گوشی موبایل اپل مدل iPhone 12 Pro Max LLA',
                            name: 'گوشی موبایل اپل مدل iPhone 12 Pro Max LLA تک سیم‌ کارت ظرفیت 256 گیگابایت و رم 6 گیگابایت - نات اکتیو',
                            colors: ['gray'],
                            price: 45000000,
                            rate: 4.6,
                            comments: [
                                   {
                                          title: 'آیفون فوق العادس تو استفاده دراز مدت ، اینو من نسخه ۲۵۶ رو دارم خیلی راضی هستم. ولی کاش دیگه همرو با حافظه ۵۱۲یا یک ترا بززن، آخه صدو بیست هشت، واقعا اختلاف قیمت زیادی داره ، و خیلی ها مجبورن از ۱۲۸ بخواطر بودجه شون بگیرن،',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Super Retina XDR OLED' },
                                   { title: 'اندازه', subTitle: '6.7' },
                                   { title: 'رزولوشن عکس', subTitle: '12 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'iOS 15' }
                            ],
                            moreInfo: {
                                   title: 'آیفون 13 پرو مکس تا دندان مسلح',
                                   text: 'گوشی‌های هوشمند خانواده آیفون 13 در قالب چهار گوشی هوشمند آیفون 13 پرو مکس، آیفون 13 پرو، آیفون 13‌ و آیفون 13 مینی معرفی شدند. پرچمداران جدید اپل این بار قدرتمند‌تر از همیشه پا به عرصه رقابت گذاشته اند تا در رقابتی بسیار جذاب، عملکردی بهتر به نسبت پرچمداران اندرویدی به نمایش بگذارد. از جمله اصلی‌ترین تغییرات در نظر گرفته شده برای این گوشی های هوشمند در مقایسه با پرچمداران خانواده آیفون 12 می‌توانیم به سنسور‌های دوربین قدرتمند‌تر، پردازنده فوق العاده با عملکرد بهتر و خیره کننده به نسبت نسل قبلی، تنوع رنگی بالا، صفحه نمایش به‌مراتب با‌کیفیت‌تراشاره کنیم. در این بررسی به‌سراغ آیفون 13 پرو مکس به عنوان گل سرسبد گوشی های هوشمند این خانواده رفته ایم تا ببینیم چه مشخصاتی را با خودش به همراه داشته و به نسبت آیفون 12 پرو مکس چه تغییرات در مشخصات فنی در نظر گرفته شده دارد.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۱۶۰.۸x۷۸.۱x۷.۷' },
                                   { title: 'وزن', subtitle: '۲۴۰ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Super Retina XDR OLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات سیم کارت', subtitle: 'سایز نانو (۸.۸ × ۱۲.۳ میلی‌متر)' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 5,
                            cardName: 'گوشی موبایل اپل مدل iPhone SE 2022 JA',
                            name: 'گوشی موبایل اپل مدل iPhone SE 2022 JA تک سیم کارت ظرفیت 128 گیگابایت و رم 4 گیگابایت',
                            colors: ['white'],
                            price: 30000000,
                            rate: 4.1,
                            comments: [
                                   {
                                          title: 'آیفون فوق العادس تو استفاده دراز مدت ، اینو من نسخه ۲۵۶ رو دارم خیلی راضی هستم. ولی کاش دیگه همرو با حافظه ۵۱۲یا یک ترا بززن، آخه صدو بیست هشت، واقعا اختلاف قیمت زیادی داره ، و خیلی ها مجبورن از ۱۲۸ بخواطر بودجه شون بگیرن،',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Super Retina XDR OLED' },
                                   { title: 'اندازه', subTitle: '6.7' },
                                   { title: 'رزولوشن عکس', subTitle: '12 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'iOS 15' }
                            ],
                            moreInfo: {
                                   title: 'آیفون 13 پرو مکس تا دندان مسلح',
                                   text: 'گوشی‌های هوشمند خانواده آیفون 13 در قالب چهار گوشی هوشمند آیفون 13 پرو مکس، آیفون 13 پرو، آیفون 13‌ و آیفون 13 مینی معرفی شدند. پرچمداران جدید اپل این بار قدرتمند‌تر از همیشه پا به عرصه رقابت گذاشته اند تا در رقابتی بسیار جذاب، عملکردی بهتر به نسبت پرچمداران اندرویدی به نمایش بگذارد. از جمله اصلی‌ترین تغییرات در نظر گرفته شده برای این گوشی های هوشمند در مقایسه با پرچمداران خانواده آیفون 12 می‌توانیم به سنسور‌های دوربین قدرتمند‌تر، پردازنده فوق العاده با عملکرد بهتر و خیره کننده به نسبت نسل قبلی، تنوع رنگی بالا، صفحه نمایش به‌مراتب با‌کیفیت‌تراشاره کنیم. در این بررسی به‌سراغ آیفون 13 پرو مکس به عنوان گل سرسبد گوشی های هوشمند این خانواده رفته ایم تا ببینیم چه مشخصاتی را با خودش به همراه داشته و به نسبت آیفون 12 پرو مکس چه تغییرات در مشخصات فنی در نظر گرفته شده دارد.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۱۶۰.۸x۷۸.۱x۷.۷' },
                                   { title: 'وزن', subtitle: '۲۴۰ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Super Retina XDR OLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات سیم کارت', subtitle: 'سایز نانو (۸.۸ × ۱۲.۳ میلی‌متر)' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 6,
                            cardName: 'گوشی موبایل اپل مدل iPhone 13 Mini',
                            name: 'گوشی موبایل اپل مدل iPhone 13 Mini ظرفیت 128 گیگابایت و رم 4 گیگابایت - نات اکتیو',
                            colors: ['teal'],
                            price: 55000000,
                            rate: 4.2,
                            comments: [
                                   {
                                          title: 'آیفون فوق العادس تو استفاده دراز مدت ، اینو من نسخه ۲۵۶ رو دارم خیلی راضی هستم. ولی کاش دیگه همرو با حافظه ۵۱۲یا یک ترا بززن، آخه صدو بیست هشت، واقعا اختلاف قیمت زیادی داره ، و خیلی ها مجبورن از ۱۲۸ بخواطر بودجه شون بگیرن،',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Super Retina XDR OLED' },
                                   { title: 'اندازه', subTitle: '6.7' },
                                   { title: 'رزولوشن عکس', subTitle: '12 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'iOS 15' }
                            ],
                            moreInfo: {
                                   title: 'آیفون 13 پرو مکس تا دندان مسلح',
                                   text: 'گوشی‌های هوشمند خانواده آیفون 13 در قالب چهار گوشی هوشمند آیفون 13 پرو مکس، آیفون 13 پرو، آیفون 13‌ و آیفون 13 مینی معرفی شدند. پرچمداران جدید اپل این بار قدرتمند‌تر از همیشه پا به عرصه رقابت گذاشته اند تا در رقابتی بسیار جذاب، عملکردی بهتر به نسبت پرچمداران اندرویدی به نمایش بگذارد. از جمله اصلی‌ترین تغییرات در نظر گرفته شده برای این گوشی های هوشمند در مقایسه با پرچمداران خانواده آیفون 12 می‌توانیم به سنسور‌های دوربین قدرتمند‌تر، پردازنده فوق العاده با عملکرد بهتر و خیره کننده به نسبت نسل قبلی، تنوع رنگی بالا، صفحه نمایش به‌مراتب با‌کیفیت‌تراشاره کنیم. در این بررسی به‌سراغ آیفون 13 پرو مکس به عنوان گل سرسبد گوشی های هوشمند این خانواده رفته ایم تا ببینیم چه مشخصاتی را با خودش به همراه داشته و به نسبت آیفون 12 پرو مکس چه تغییرات در مشخصات فنی در نظر گرفته شده دارد.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۱۶۰.۸x۷۸.۱x۷.۷' },
                                   { title: 'وزن', subtitle: '۲۴۰ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Super Retina XDR OLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات سیم کارت', subtitle: 'سایز نانو (۸.۸ × ۱۲.۳ میلی‌متر)' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 7,
                            cardName: 'گوشی موبایل اپل مدل iPhone 13 Pro',
                            name: 'گوشی موبایل اپل مدل iPhone 13 Pro تک سیم کارت ظرفیت یک ترابایت و رم 6 گیگابایت - اروپا نات اکتیو',
                            colors: ['gray'],
                            price: 60000000,
                            rate: 4.4,
                            comments: [
                                   {
                                          title: 'آیفون فوق العادس تو استفاده دراز مدت ، اینو من نسخه ۲۵۶ رو دارم خیلی راضی هستم. ولی کاش دیگه همرو با حافظه ۵۱۲یا یک ترا بززن، آخه صدو بیست هشت، واقعا اختلاف قیمت زیادی داره ، و خیلی ها مجبورن از ۱۲۸ بخواطر بودجه شون بگیرن،',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Super Retina XDR OLED' },
                                   { title: 'اندازه', subTitle: '6.7' },
                                   { title: 'رزولوشن عکس', subTitle: '12 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'iOS 15' }
                            ],
                            moreInfo: {
                                   title: 'آیفون 13 پرو مکس تا دندان مسلح',
                                   text: 'گوشی‌های هوشمند خانواده آیفون 13 در قالب چهار گوشی هوشمند آیفون 13 پرو مکس، آیفون 13 پرو، آیفون 13‌ و آیفون 13 مینی معرفی شدند. پرچمداران جدید اپل این بار قدرتمند‌تر از همیشه پا به عرصه رقابت گذاشته اند تا در رقابتی بسیار جذاب، عملکردی بهتر به نسبت پرچمداران اندرویدی به نمایش بگذارد. از جمله اصلی‌ترین تغییرات در نظر گرفته شده برای این گوشی های هوشمند در مقایسه با پرچمداران خانواده آیفون 12 می‌توانیم به سنسور‌های دوربین قدرتمند‌تر، پردازنده فوق العاده با عملکرد بهتر و خیره کننده به نسبت نسل قبلی، تنوع رنگی بالا، صفحه نمایش به‌مراتب با‌کیفیت‌تراشاره کنیم. در این بررسی به‌سراغ آیفون 13 پرو مکس به عنوان گل سرسبد گوشی های هوشمند این خانواده رفته ایم تا ببینیم چه مشخصاتی را با خودش به همراه داشته و به نسبت آیفون 12 پرو مکس چه تغییرات در مشخصات فنی در نظر گرفته شده دارد.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۱۶۰.۸x۷۸.۱x۷.۷' },
                                   { title: 'وزن', subtitle: '۲۴۰ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Super Retina XDR OLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات سیم کارت', subtitle: 'سایز نانو (۸.۸ × ۱۲.۳ میلی‌متر)' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
              ],
              samsung: [
                     {
                            id: 1,
                            cardName: 'گوشی موبایل سامسونگ مدل Galaxy S23',
                            name: 'گوشی موبایل سامسونگ مدل Galaxy S23 دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت',
                            colors: ['black', 'green', 'cream'],
                            price: 39900000,
                            rate: 4.3,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Dynamic AMOLED 2X' },
                                   { title: 'اندازه', subTitle: '6.1' },
                                   { title: 'رزولوشن عکس', subTitle: '50 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'خوش ساخت‌ترین پرچمدار خانواده S23',
                                   text: 'سامسونگ همانند هر سال که چند گوشی را در قالب پرچمداران جدیدش معرفی می‌کرد، این بار هم سه گوشی هوشمند را در قالب خانواده S23 روانه بازار کرد. سامسونگ Galaxy S23 هم کوچکتری عضو این خانواده‌ است که در اکثر مشخصات فنی در نظر گرفته شده تفاوتی با مدل Galaxy S23 Plus ندارد. سامسونگ این بار از طراحی ساده و البته بسیار زیبایی برای این گوشی استفاده کرده که تفاوت اصلی طراحی این گوشی با نسل قبلی (Galaxy S22)، در قسمت پشتی است. در این قسمت دیگر خبری از بریدگی و معماری خاصی برای قرار‌گیری سنسور‌های دوربین نیست و سه سنسور دوربین با چیدمان ستونی شکل کنار یکدیگر قرار گرفته‌اند.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۶×۷۰.۹×۱۴۶.۳' },
                                   { title: 'وزن', subtitle: '۱۶۸ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Dynamic AMOLED ۲X' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],

                     },
                     {
                            id: 2,
                            cardName: 'گوشی موبایل سامسونگ مدل Galaxy Z Fold',
                            name: 'گوشی موبایل سامسونگ مدل Galaxy Z Fold5 دو سیم کارت ظرفیت 256 گیگابایت و رم 12 گیگابایت - ویتنام',
                            colors: ['black'],
                            price: 76399000,
                            rate: 4.5,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Dynamic AMOLED 2X' },
                                   { title: 'اندازه', subTitle: '6.1' },
                                   { title: 'رزولوشن عکس', subTitle: '50 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'خوش ساخت‌ترین پرچمدار خانواده S23',
                                   text: 'سامسونگ همانند هر سال که چند گوشی را در قالب پرچمداران جدیدش معرفی می‌کرد، این بار هم سه گوشی هوشمند را در قالب خانواده S23 روانه بازار کرد. سامسونگ Galaxy S23 هم کوچکتری عضو این خانواده‌ است که در اکثر مشخصات فنی در نظر گرفته شده تفاوتی با مدل Galaxy S23 Plus ندارد. سامسونگ این بار از طراحی ساده و البته بسیار زیبایی برای این گوشی استفاده کرده که تفاوت اصلی طراحی این گوشی با نسل قبلی (Galaxy S22)، در قسمت پشتی است. در این قسمت دیگر خبری از بریدگی و معماری خاصی برای قرار‌گیری سنسور‌های دوربین نیست و سه سنسور دوربین با چیدمان ستونی شکل کنار یکدیگر قرار گرفته‌اند.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۶×۷۰.۹×۱۴۶.۳' },
                                   { title: 'وزن', subtitle: '۱۶۸ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Dynamic AMOLED ۲X' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],

                     },
                     {
                            id: 3,
                            cardName: 'گوشی موبایل سامسونگ مدل Galaxy A24 4G',
                            name: 'گوشی موبایل سامسونگ مدل Galaxy A24 4G دو سیم کارت ظرفیت 128 گیگابایت و رم 4 گیگابایت - ویتنام',
                            colors: ['black'],
                            price: 7770000,
                            rate: 4.4,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Dynamic AMOLED 2X' },
                                   { title: 'اندازه', subTitle: '6.1' },
                                   { title: 'رزولوشن عکس', subTitle: '50 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'خوش ساخت‌ترین پرچمدار خانواده S23',
                                   text: 'سامسونگ همانند هر سال که چند گوشی را در قالب پرچمداران جدیدش معرفی می‌کرد، این بار هم سه گوشی هوشمند را در قالب خانواده S23 روانه بازار کرد. سامسونگ Galaxy S23 هم کوچکتری عضو این خانواده‌ است که در اکثر مشخصات فنی در نظر گرفته شده تفاوتی با مدل Galaxy S23 Plus ندارد. سامسونگ این بار از طراحی ساده و البته بسیار زیبایی برای این گوشی استفاده کرده که تفاوت اصلی طراحی این گوشی با نسل قبلی (Galaxy S22)، در قسمت پشتی است. در این قسمت دیگر خبری از بریدگی و معماری خاصی برای قرار‌گیری سنسور‌های دوربین نیست و سه سنسور دوربین با چیدمان ستونی شکل کنار یکدیگر قرار گرفته‌اند.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۶×۷۰.۹×۱۴۶.۳' },
                                   { title: 'وزن', subtitle: '۱۶۸ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Dynamic AMOLED ۲X' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],

                     },
                     {
                            id: 4,
                            cardName: 'گوشی موبایل سامسونگ مدل Galaxy A54 5G',
                            name: 'گوشی موبایل سامسونگ مدل Galaxy A54 5G دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت',
                            colors: ['black'],
                            price: 7770000,
                            rate: 4.3,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Dynamic AMOLED 2X' },
                                   { title: 'اندازه', subTitle: '6.1' },
                                   { title: 'رزولوشن عکس', subTitle: '50 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'خوش ساخت‌ترین پرچمدار خانواده S23',
                                   text: 'سامسونگ همانند هر سال که چند گوشی را در قالب پرچمداران جدیدش معرفی می‌کرد، این بار هم سه گوشی هوشمند را در قالب خانواده S23 روانه بازار کرد. سامسونگ Galaxy S23 هم کوچکتری عضو این خانواده‌ است که در اکثر مشخصات فنی در نظر گرفته شده تفاوتی با مدل Galaxy S23 Plus ندارد. سامسونگ این بار از طراحی ساده و البته بسیار زیبایی برای این گوشی استفاده کرده که تفاوت اصلی طراحی این گوشی با نسل قبلی (Galaxy S22)، در قسمت پشتی است. در این قسمت دیگر خبری از بریدگی و معماری خاصی برای قرار‌گیری سنسور‌های دوربین نیست و سه سنسور دوربین با چیدمان ستونی شکل کنار یکدیگر قرار گرفته‌اند.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۶×۷۰.۹×۱۴۶.۳' },
                                   { title: 'وزن', subtitle: '۱۶۸ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Dynamic AMOLED ۲X' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 5,
                            cardName: 'گوشی موبایل سامسونگ مدل Galaxy A13',
                            name: 'گوشی موبایل سامسونگ مدل Galaxy A13 دو سیم کارت ظرفیت 64 گیگابایت و رم 4 گیگابایت به همراه شارژر',
                            colors: ['black'],
                            price: 6899000,
                            rate: 4.3,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Dynamic AMOLED 2X' },
                                   { title: 'اندازه', subTitle: '6.1' },
                                   { title: 'رزولوشن عکس', subTitle: '50 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'خوش ساخت‌ترین پرچمدار خانواده S23',
                                   text: 'سامسونگ همانند هر سال که چند گوشی را در قالب پرچمداران جدیدش معرفی می‌کرد، این بار هم سه گوشی هوشمند را در قالب خانواده S23 روانه بازار کرد. سامسونگ Galaxy S23 هم کوچکتری عضو این خانواده‌ است که در اکثر مشخصات فنی در نظر گرفته شده تفاوتی با مدل Galaxy S23 Plus ندارد. سامسونگ این بار از طراحی ساده و البته بسیار زیبایی برای این گوشی استفاده کرده که تفاوت اصلی طراحی این گوشی با نسل قبلی (Galaxy S22)، در قسمت پشتی است. در این قسمت دیگر خبری از بریدگی و معماری خاصی برای قرار‌گیری سنسور‌های دوربین نیست و سه سنسور دوربین با چیدمان ستونی شکل کنار یکدیگر قرار گرفته‌اند.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۶×۷۰.۹×۱۴۶.۳' },
                                   { title: 'وزن', subtitle: '۱۶۸ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Dynamic AMOLED ۲X' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 6,
                            cardName: 'گوشی موبایل سامسونگ مدل Galaxy A14',
                            name: 'گوشی موبایل سامسونگ مدل Galaxy A14 دو سیم کارت ظرفیت 64 گیگابایت و رم 4 گیگابایت به همراه شارژر',
                            colors: ['black', 'silver', 'lightgreen'],
                            price: 6950000,
                            rate: 4.4,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Dynamic AMOLED 2X' },
                                   { title: 'اندازه', subTitle: '6.1' },
                                   { title: 'رزولوشن عکس', subTitle: '50 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'خوش ساخت‌ترین پرچمدار خانواده S23',
                                   text: 'سامسونگ همانند هر سال که چند گوشی را در قالب پرچمداران جدیدش معرفی می‌کرد، این بار هم سه گوشی هوشمند را در قالب خانواده S23 روانه بازار کرد. سامسونگ Galaxy S23 هم کوچکتری عضو این خانواده‌ است که در اکثر مشخصات فنی در نظر گرفته شده تفاوتی با مدل Galaxy S23 Plus ندارد. سامسونگ این بار از طراحی ساده و البته بسیار زیبایی برای این گوشی استفاده کرده که تفاوت اصلی طراحی این گوشی با نسل قبلی (Galaxy S22)، در قسمت پشتی است. در این قسمت دیگر خبری از بریدگی و معماری خاصی برای قرار‌گیری سنسور‌های دوربین نیست و سه سنسور دوربین با چیدمان ستونی شکل کنار یکدیگر قرار گرفته‌اند.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۶×۷۰.۹×۱۴۶.۳' },
                                   { title: 'وزن', subtitle: '۱۶۸ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Dynamic AMOLED ۲X' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 7,
                            cardName: 'گوشی موبایل سامسونگ مدل Galaxy A34 5G',
                            name: 'گوشی موبایل سامسونگ مدل Galaxy A34 5G دو سیم کارت ظرفیت 128 گیگابایت و رم 8 گیگابایت ',
                            colors: ['yellow'],
                            price: 10530000,
                            rate: 4.3,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'Dynamic AMOLED 2X' },
                                   { title: 'اندازه', subTitle: '6.1' },
                                   { title: 'رزولوشن عکس', subTitle: '50 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'خوش ساخت‌ترین پرچمدار خانواده S23',
                                   text: 'سامسونگ همانند هر سال که چند گوشی را در قالب پرچمداران جدیدش معرفی می‌کرد، این بار هم سه گوشی هوشمند را در قالب خانواده S23 روانه بازار کرد. سامسونگ Galaxy S23 هم کوچکتری عضو این خانواده‌ است که در اکثر مشخصات فنی در نظر گرفته شده تفاوتی با مدل Galaxy S23 Plus ندارد. سامسونگ این بار از طراحی ساده و البته بسیار زیبایی برای این گوشی استفاده کرده که تفاوت اصلی طراحی این گوشی با نسل قبلی (Galaxy S22)، در قسمت پشتی است. در این قسمت دیگر خبری از بریدگی و معماری خاصی برای قرار‌گیری سنسور‌های دوربین نیست و سه سنسور دوربین با چیدمان ستونی شکل کنار یکدیگر قرار گرفته‌اند.'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۶×۷۰.۹×۱۴۶.۳' },
                                   { title: 'وزن', subtitle: '۱۶۸ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'Dynamic AMOLED ۲X' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
              ],
              xiamo: [
                     {
                            id: 1,
                            cardName: 'گوشی موبایل شیائومی مدل Poco F5 ',
                            name: 'گوشی موبایل شیائومی مدل Poco F5 دو سیم کارت ظرفیت 256 گیگابایت و رم 12 گیگابایت - گلوبال',
                            colors: ['yellow'],
                            price: 18199000,
                            rate: 4.6,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'AMOLED' },
                                   { title: 'اندازه', subTitle: '6.67' },
                                   { title: 'رزولوشن عکس', subTitle: '64 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'Poco F5',
                                   text: 'اگر به دنبال خرید گوشی هوشمند میان‌رده‌ای هستید که در کنار بهره بردن از مشخصات فنی قدرتمند، قیمت مقرون به‌صرفه‌ای هم داشته باشد، بدون شک گوشی‌های سری poco شیائومی می‌توانند انتخاب بسیار خوبی باشند. یکی از این گوشی‌های با‌کیفین، Poco F5 است که بدون هیچ تعریف اضافی باید بگوییم که از مشخصات فنی قدرتمندی بهره برده است. صفحه‌نمایش 6.67 اینچی این گوشی با رزولوشن 1080×2400 پیکسل از نوع امولد که توانایی ارائه نرخ بروزرسانی 120 هرتز و حداکثر روشنایی 1000 نیت (nits) را دارد، عملکردی فراتر از یک گوشی میان‌رده را به شما ارائه می‌کند. حضور سنسور 64 مگاپیکسل اصلی سبب شده تا در نور روز و نور شب تجربه عکاسی بسیار لذت بخشی را با این گوشی داشته باشید. سنسور 8 مگاپیکسل فوق عریض یا همان ultrawide برای عکاسی در فضای باز و عکس‌های دسته‌جمعی و سنسور 2 مگاپیکسل ماکرو برای ثبت تصاویر از فاصله نزدیک، دو سنسور دوربین قسمت پشتی این گوشی هوشمند را تشکیل می‌دهند. برای دوربین سلفی هم سنسور 16 مگاپیکسل در نظر گرفته شده که در نور روز عملکرد بسیار خوبی دارد. در بخش فیلمبرداری هم توانایی ضبط ویدیو با حداکثر کیفیت 4K، سبب شده تا در این بخش هم عملکرد بسیار خوبی را از Poco F5 شاهد باشید. در بخش مشخصات سخت‌افزاری هم این گوشی به یکی از بهترین پردازنده‌های شرکت کوالکام، یعنی اسنپدراگون 7 پلاس نسل دو مجهز شده که در اجرای بازی‌های سنگین و بر‌نامه‌های کاربردی، عملکرد بسیار خوبی دارد. باتری با میزان ظرفیت 5000 میلی‌آمپر‌ساعت و پشتیبانی از فناوری شارژ 67 وات، از دیگر مشخصات در نظر گرفته شده هستند. در مجموع باید بگوییم که Poco F5 با بهره بردن از صفحه‌نمایش بسیار با‌کیفیت، طراحی جذاب، دوربین اصلی قدرتمند و مشخصات سخت‌افزاری کاملا مناسب و قابل قبول، می‌تواند یکی از بهترین انتخاب‌های ممکن در بین گوشی‌های میان‌رده این بازه قیمتی باشد'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۹×۷۵×۱۶۱.۱' },
                                   { title: 'وزن', subtitle: '۱۸۱ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'AMOLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 2,
                            cardName: 'گوشی موبایل شیائومی مدل Poco C40  ',
                            name: 'گوشی موبایل شیائومی مدل Poco C40 دو سیم کارت ظرفیت 64 گیگابایت و رم 4 گیگابایت- گلوبال',
                            colors: ['lightgreen', 'black'],
                            price: 3850000,
                            rate: 4.3,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'AMOLED' },
                                   { title: 'اندازه', subTitle: '6.67' },
                                   { title: 'رزولوشن عکس', subTitle: '64 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'Poco F5',
                                   text: 'اگر به دنبال خرید گوشی هوشمند میان‌رده‌ای هستید که در کنار بهره بردن از مشخصات فنی قدرتمند، قیمت مقرون به‌صرفه‌ای هم داشته باشد، بدون شک گوشی‌های سری poco شیائومی می‌توانند انتخاب بسیار خوبی باشند. یکی از این گوشی‌های با‌کیفین، Poco F5 است که بدون هیچ تعریف اضافی باید بگوییم که از مشخصات فنی قدرتمندی بهره برده است. صفحه‌نمایش 6.67 اینچی این گوشی با رزولوشن 1080×2400 پیکسل از نوع امولد که توانایی ارائه نرخ بروزرسانی 120 هرتز و حداکثر روشنایی 1000 نیت (nits) را دارد، عملکردی فراتر از یک گوشی میان‌رده را به شما ارائه می‌کند. حضور سنسور 64 مگاپیکسل اصلی سبب شده تا در نور روز و نور شب تجربه عکاسی بسیار لذت بخشی را با این گوشی داشته باشید. سنسور 8 مگاپیکسل فوق عریض یا همان ultrawide برای عکاسی در فضای باز و عکس‌های دسته‌جمعی و سنسور 2 مگاپیکسل ماکرو برای ثبت تصاویر از فاصله نزدیک، دو سنسور دوربین قسمت پشتی این گوشی هوشمند را تشکیل می‌دهند. برای دوربین سلفی هم سنسور 16 مگاپیکسل در نظر گرفته شده که در نور روز عملکرد بسیار خوبی دارد. در بخش فیلمبرداری هم توانایی ضبط ویدیو با حداکثر کیفیت 4K، سبب شده تا در این بخش هم عملکرد بسیار خوبی را از Poco F5 شاهد باشید. در بخش مشخصات سخت‌افزاری هم این گوشی به یکی از بهترین پردازنده‌های شرکت کوالکام، یعنی اسنپدراگون 7 پلاس نسل دو مجهز شده که در اجرای بازی‌های سنگین و بر‌نامه‌های کاربردی، عملکرد بسیار خوبی دارد. باتری با میزان ظرفیت 5000 میلی‌آمپر‌ساعت و پشتیبانی از فناوری شارژ 67 وات، از دیگر مشخصات در نظر گرفته شده هستند. در مجموع باید بگوییم که Poco F5 با بهره بردن از صفحه‌نمایش بسیار با‌کیفیت، طراحی جذاب، دوربین اصلی قدرتمند و مشخصات سخت‌افزاری کاملا مناسب و قابل قبول، می‌تواند یکی از بهترین انتخاب‌های ممکن در بین گوشی‌های میان‌رده این بازه قیمتی باشد'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۹×۷۵×۱۶۱.۱' },
                                   { title: 'وزن', subtitle: '۱۸۱ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'AMOLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],

                     },
                     {
                            id: 3,
                            cardName: 'گوشی موبایل شیائومی مدل Redmi Note 12 Pro 4G',
                            name: 'گوشی موبایل شیائومی مدل Redmi Note 12 Pro 4G دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت - گلوبال',
                            colors: ['lightskyblue', 'gray', 'white'],
                            price: 10399000,
                            rate: 4.4,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'AMOLED' },
                                   { title: 'اندازه', subTitle: '6.67' },
                                   { title: 'رزولوشن عکس', subTitle: '64 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'Poco F5',
                                   text: 'اگر به دنبال خرید گوشی هوشمند میان‌رده‌ای هستید که در کنار بهره بردن از مشخصات فنی قدرتمند، قیمت مقرون به‌صرفه‌ای هم داشته باشد، بدون شک گوشی‌های سری poco شیائومی می‌توانند انتخاب بسیار خوبی باشند. یکی از این گوشی‌های با‌کیفین، Poco F5 است که بدون هیچ تعریف اضافی باید بگوییم که از مشخصات فنی قدرتمندی بهره برده است. صفحه‌نمایش 6.67 اینچی این گوشی با رزولوشن 1080×2400 پیکسل از نوع امولد که توانایی ارائه نرخ بروزرسانی 120 هرتز و حداکثر روشنایی 1000 نیت (nits) را دارد، عملکردی فراتر از یک گوشی میان‌رده را به شما ارائه می‌کند. حضور سنسور 64 مگاپیکسل اصلی سبب شده تا در نور روز و نور شب تجربه عکاسی بسیار لذت بخشی را با این گوشی داشته باشید. سنسور 8 مگاپیکسل فوق عریض یا همان ultrawide برای عکاسی در فضای باز و عکس‌های دسته‌جمعی و سنسور 2 مگاپیکسل ماکرو برای ثبت تصاویر از فاصله نزدیک، دو سنسور دوربین قسمت پشتی این گوشی هوشمند را تشکیل می‌دهند. برای دوربین سلفی هم سنسور 16 مگاپیکسل در نظر گرفته شده که در نور روز عملکرد بسیار خوبی دارد. در بخش فیلمبرداری هم توانایی ضبط ویدیو با حداکثر کیفیت 4K، سبب شده تا در این بخش هم عملکرد بسیار خوبی را از Poco F5 شاهد باشید. در بخش مشخصات سخت‌افزاری هم این گوشی به یکی از بهترین پردازنده‌های شرکت کوالکام، یعنی اسنپدراگون 7 پلاس نسل دو مجهز شده که در اجرای بازی‌های سنگین و بر‌نامه‌های کاربردی، عملکرد بسیار خوبی دارد. باتری با میزان ظرفیت 5000 میلی‌آمپر‌ساعت و پشتیبانی از فناوری شارژ 67 وات، از دیگر مشخصات در نظر گرفته شده هستند. در مجموع باید بگوییم که Poco F5 با بهره بردن از صفحه‌نمایش بسیار با‌کیفیت، طراحی جذاب، دوربین اصلی قدرتمند و مشخصات سخت‌افزاری کاملا مناسب و قابل قبول، می‌تواند یکی از بهترین انتخاب‌های ممکن در بین گوشی‌های میان‌رده این بازه قیمتی باشد'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۹×۷۵×۱۶۱.۱' },
                                   { title: 'وزن', subtitle: '۱۸۱ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'AMOLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
                     {
                            id: 4,
                            cardName: 'گوشی موبایل شیائومی مدل Redmi Note 12 4G',
                            name: 'گوشی موبایل شیائومی مدل Redmi Note 12 4G دو سیم کارت ظرفیت 128 گیگابایت و رم 8 گیگابایت - گلوبال',
                            colors: ['lightskyblue', 'lightgreen', 'gray'],
                            price: 7199000,
                            rate: 4.4,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'AMOLED' },
                                   { title: 'اندازه', subTitle: '6.67' },
                                   { title: 'رزولوشن عکس', subTitle: '64 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'Poco F5',
                                   text: 'اگر به دنبال خرید گوشی هوشمند میان‌رده‌ای هستید که در کنار بهره بردن از مشخصات فنی قدرتمند، قیمت مقرون به‌صرفه‌ای هم داشته باشد، بدون شک گوشی‌های سری poco شیائومی می‌توانند انتخاب بسیار خوبی باشند. یکی از این گوشی‌های با‌کیفین، Poco F5 است که بدون هیچ تعریف اضافی باید بگوییم که از مشخصات فنی قدرتمندی بهره برده است. صفحه‌نمایش 6.67 اینچی این گوشی با رزولوشن 1080×2400 پیکسل از نوع امولد که توانایی ارائه نرخ بروزرسانی 120 هرتز و حداکثر روشنایی 1000 نیت (nits) را دارد، عملکردی فراتر از یک گوشی میان‌رده را به شما ارائه می‌کند. حضور سنسور 64 مگاپیکسل اصلی سبب شده تا در نور روز و نور شب تجربه عکاسی بسیار لذت بخشی را با این گوشی داشته باشید. سنسور 8 مگاپیکسل فوق عریض یا همان ultrawide برای عکاسی در فضای باز و عکس‌های دسته‌جمعی و سنسور 2 مگاپیکسل ماکرو برای ثبت تصاویر از فاصله نزدیک، دو سنسور دوربین قسمت پشتی این گوشی هوشمند را تشکیل می‌دهند. برای دوربین سلفی هم سنسور 16 مگاپیکسل در نظر گرفته شده که در نور روز عملکرد بسیار خوبی دارد. در بخش فیلمبرداری هم توانایی ضبط ویدیو با حداکثر کیفیت 4K، سبب شده تا در این بخش هم عملکرد بسیار خوبی را از Poco F5 شاهد باشید. در بخش مشخصات سخت‌افزاری هم این گوشی به یکی از بهترین پردازنده‌های شرکت کوالکام، یعنی اسنپدراگون 7 پلاس نسل دو مجهز شده که در اجرای بازی‌های سنگین و بر‌نامه‌های کاربردی، عملکرد بسیار خوبی دارد. باتری با میزان ظرفیت 5000 میلی‌آمپر‌ساعت و پشتیبانی از فناوری شارژ 67 وات، از دیگر مشخصات در نظر گرفته شده هستند. در مجموع باید بگوییم که Poco F5 با بهره بردن از صفحه‌نمایش بسیار با‌کیفیت، طراحی جذاب، دوربین اصلی قدرتمند و مشخصات سخت‌افزاری کاملا مناسب و قابل قبول، می‌تواند یکی از بهترین انتخاب‌های ممکن در بین گوشی‌های میان‌رده این بازه قیمتی باشد'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۹×۷۵×۱۶۱.۱' },
                                   { title: 'وزن', subtitle: '۱۸۱ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'AMOLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],

                     },
                     {
                            id: 5,
                            cardName: 'گوشی موبایل شیائومی مدل Poco F5 Pro',
                            name: 'گوشی موبایل شیائومی مدل Poco F5 Pro دو سیم کارت ظرفیت 512 گیگابایت و رم 12 گیگابایت - گلوبال',
                            colors: ['black'],
                            price: 24700000,
                            rate: 4.8,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'AMOLED' },
                                   { title: 'اندازه', subTitle: '6.67' },
                                   { title: 'رزولوشن عکس', subTitle: '64 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'Poco F5',
                                   text: 'اگر به دنبال خرید گوشی هوشمند میان‌رده‌ای هستید که در کنار بهره بردن از مشخصات فنی قدرتمند، قیمت مقرون به‌صرفه‌ای هم داشته باشد، بدون شک گوشی‌های سری poco شیائومی می‌توانند انتخاب بسیار خوبی باشند. یکی از این گوشی‌های با‌کیفین، Poco F5 است که بدون هیچ تعریف اضافی باید بگوییم که از مشخصات فنی قدرتمندی بهره برده است. صفحه‌نمایش 6.67 اینچی این گوشی با رزولوشن 1080×2400 پیکسل از نوع امولد که توانایی ارائه نرخ بروزرسانی 120 هرتز و حداکثر روشنایی 1000 نیت (nits) را دارد، عملکردی فراتر از یک گوشی میان‌رده را به شما ارائه می‌کند. حضور سنسور 64 مگاپیکسل اصلی سبب شده تا در نور روز و نور شب تجربه عکاسی بسیار لذت بخشی را با این گوشی داشته باشید. سنسور 8 مگاپیکسل فوق عریض یا همان ultrawide برای عکاسی در فضای باز و عکس‌های دسته‌جمعی و سنسور 2 مگاپیکسل ماکرو برای ثبت تصاویر از فاصله نزدیک، دو سنسور دوربین قسمت پشتی این گوشی هوشمند را تشکیل می‌دهند. برای دوربین سلفی هم سنسور 16 مگاپیکسل در نظر گرفته شده که در نور روز عملکرد بسیار خوبی دارد. در بخش فیلمبرداری هم توانایی ضبط ویدیو با حداکثر کیفیت 4K، سبب شده تا در این بخش هم عملکرد بسیار خوبی را از Poco F5 شاهد باشید. در بخش مشخصات سخت‌افزاری هم این گوشی به یکی از بهترین پردازنده‌های شرکت کوالکام، یعنی اسنپدراگون 7 پلاس نسل دو مجهز شده که در اجرای بازی‌های سنگین و بر‌نامه‌های کاربردی، عملکرد بسیار خوبی دارد. باتری با میزان ظرفیت 5000 میلی‌آمپر‌ساعت و پشتیبانی از فناوری شارژ 67 وات، از دیگر مشخصات در نظر گرفته شده هستند. در مجموع باید بگوییم که Poco F5 با بهره بردن از صفحه‌نمایش بسیار با‌کیفیت، طراحی جذاب، دوربین اصلی قدرتمند و مشخصات سخت‌افزاری کاملا مناسب و قابل قبول، می‌تواند یکی از بهترین انتخاب‌های ممکن در بین گوشی‌های میان‌رده این بازه قیمتی باشد'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۹×۷۵×۱۶۱.۱' },
                                   { title: 'وزن', subtitle: '۱۸۱ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'AMOLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],

                     },
                     {
                            id: 6,
                            cardName: 'گوشی موبایل شیائومی مدل Redmi Note 12 Pro Plus 5G',
                            name: 'گوشی موبایل شیائومی مدل Redmi Note 12 Pro Plus 5G دو سیم کارت ظرفیت 256 گیگابایت و رم 12 گیگابایت - پک چین',
                            colors: ['black'],
                            price: 21450000,
                            rate: 3.9,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'AMOLED' },
                                   { title: 'اندازه', subTitle: '6.67' },
                                   { title: 'رزولوشن عکس', subTitle: '64 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'Poco F5',
                                   text: 'اگر به دنبال خرید گوشی هوشمند میان‌رده‌ای هستید که در کنار بهره بردن از مشخصات فنی قدرتمند، قیمت مقرون به‌صرفه‌ای هم داشته باشد، بدون شک گوشی‌های سری poco شیائومی می‌توانند انتخاب بسیار خوبی باشند. یکی از این گوشی‌های با‌کیفین، Poco F5 است که بدون هیچ تعریف اضافی باید بگوییم که از مشخصات فنی قدرتمندی بهره برده است. صفحه‌نمایش 6.67 اینچی این گوشی با رزولوشن 1080×2400 پیکسل از نوع امولد که توانایی ارائه نرخ بروزرسانی 120 هرتز و حداکثر روشنایی 1000 نیت (nits) را دارد، عملکردی فراتر از یک گوشی میان‌رده را به شما ارائه می‌کند. حضور سنسور 64 مگاپیکسل اصلی سبب شده تا در نور روز و نور شب تجربه عکاسی بسیار لذت بخشی را با این گوشی داشته باشید. سنسور 8 مگاپیکسل فوق عریض یا همان ultrawide برای عکاسی در فضای باز و عکس‌های دسته‌جمعی و سنسور 2 مگاپیکسل ماکرو برای ثبت تصاویر از فاصله نزدیک، دو سنسور دوربین قسمت پشتی این گوشی هوشمند را تشکیل می‌دهند. برای دوربین سلفی هم سنسور 16 مگاپیکسل در نظر گرفته شده که در نور روز عملکرد بسیار خوبی دارد. در بخش فیلمبرداری هم توانایی ضبط ویدیو با حداکثر کیفیت 4K، سبب شده تا در این بخش هم عملکرد بسیار خوبی را از Poco F5 شاهد باشید. در بخش مشخصات سخت‌افزاری هم این گوشی به یکی از بهترین پردازنده‌های شرکت کوالکام، یعنی اسنپدراگون 7 پلاس نسل دو مجهز شده که در اجرای بازی‌های سنگین و بر‌نامه‌های کاربردی، عملکرد بسیار خوبی دارد. باتری با میزان ظرفیت 5000 میلی‌آمپر‌ساعت و پشتیبانی از فناوری شارژ 67 وات، از دیگر مشخصات در نظر گرفته شده هستند. در مجموع باید بگوییم که Poco F5 با بهره بردن از صفحه‌نمایش بسیار با‌کیفیت، طراحی جذاب، دوربین اصلی قدرتمند و مشخصات سخت‌افزاری کاملا مناسب و قابل قبول، می‌تواند یکی از بهترین انتخاب‌های ممکن در بین گوشی‌های میان‌رده این بازه قیمتی باشد'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۹×۷۵×۱۶۱.۱' },
                                   { title: 'وزن', subtitle: '۱۸۱ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'AMOLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],

                     },
                     {
                            id: 7,
                            cardName: 'گوشی موبایل شیائومی مدل Redmi Note 12 Explorer',
                            name: 'گوشی موبایل شیائومی مدل Redmi Note 12 Explorer دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت - پک چین',
                            colors: ['black', 'gray'],
                            price: 17000000,
                            rate: 1,
                            comments: [
                                   {
                                          title: 'دوستان همه میگن عالیه پس عالیه',
                                          color: 'gold',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'بدون مشکل به دستم رسید',
                                          color: 'lightskyblue',
                                          rate: 5
                                   }
                                   ,
                                   {
                                          title: 'موبایلی با کیفیت و کارایی بالا اما گران',
                                          rate: 5
                                   }

                            ],
                            propertys: [
                                   { title: 'فناوری صفحه‌نمایش', subTitle: 'AMOLED' },
                                   { title: 'اندازه', subTitle: '6.67' },
                                   { title: 'رزولوشن عکس', subTitle: '64 مگاپیکسل' },
                                   { title: 'نسخه سیستم عامل', subTitle: 'Android 13' }
                            ],
                            moreInfo: {
                                   title: 'Poco F5',
                                   text: 'اگر به دنبال خرید گوشی هوشمند میان‌رده‌ای هستید که در کنار بهره بردن از مشخصات فنی قدرتمند، قیمت مقرون به‌صرفه‌ای هم داشته باشد، بدون شک گوشی‌های سری poco شیائومی می‌توانند انتخاب بسیار خوبی باشند. یکی از این گوشی‌های با‌کیفین، Poco F5 است که بدون هیچ تعریف اضافی باید بگوییم که از مشخصات فنی قدرتمندی بهره برده است. صفحه‌نمایش 6.67 اینچی این گوشی با رزولوشن 1080×2400 پیکسل از نوع امولد که توانایی ارائه نرخ بروزرسانی 120 هرتز و حداکثر روشنایی 1000 نیت (nits) را دارد، عملکردی فراتر از یک گوشی میان‌رده را به شما ارائه می‌کند. حضور سنسور 64 مگاپیکسل اصلی سبب شده تا در نور روز و نور شب تجربه عکاسی بسیار لذت بخشی را با این گوشی داشته باشید. سنسور 8 مگاپیکسل فوق عریض یا همان ultrawide برای عکاسی در فضای باز و عکس‌های دسته‌جمعی و سنسور 2 مگاپیکسل ماکرو برای ثبت تصاویر از فاصله نزدیک، دو سنسور دوربین قسمت پشتی این گوشی هوشمند را تشکیل می‌دهند. برای دوربین سلفی هم سنسور 16 مگاپیکسل در نظر گرفته شده که در نور روز عملکرد بسیار خوبی دارد. در بخش فیلمبرداری هم توانایی ضبط ویدیو با حداکثر کیفیت 4K، سبب شده تا در این بخش هم عملکرد بسیار خوبی را از Poco F5 شاهد باشید. در بخش مشخصات سخت‌افزاری هم این گوشی به یکی از بهترین پردازنده‌های شرکت کوالکام، یعنی اسنپدراگون 7 پلاس نسل دو مجهز شده که در اجرای بازی‌های سنگین و بر‌نامه‌های کاربردی، عملکرد بسیار خوبی دارد. باتری با میزان ظرفیت 5000 میلی‌آمپر‌ساعت و پشتیبانی از فناوری شارژ 67 وات، از دیگر مشخصات در نظر گرفته شده هستند. در مجموع باید بگوییم که Poco F5 با بهره بردن از صفحه‌نمایش بسیار با‌کیفیت، طراحی جذاب، دوربین اصلی قدرتمند و مشخصات سخت‌افزاری کاملا مناسب و قابل قبول، می‌تواند یکی از بهترین انتخاب‌های ممکن در بین گوشی‌های میان‌رده این بازه قیمتی باشد'
                            },
                            Specifications: [
                                   { title: 'ابعاد', subtitle: '۷.۹×۷۵×۱۶۱.۱' },
                                   { title: 'وزن', subtitle: '۱۸۱ گرم' },
                                   { title: 'فناوری صفحه‌نمایش', subtitle: 'AMOLED' },
                                   { title: 'بازه‌ی اندازه صفحه نمایش', subtitle: '۶.۰ اینچ و بزرگتر' },
                                   { title: 'توضیحات کارت حافظه جانبی', subtitle: 'عدم پشتیبانی' },
                            ],
                            questions: [
                                   'سلام خسته نباشید سوال داشتم کسایی که این مدل گوشی روخریدن با حافظه اش مشکل نداشتن',
                                   'سلام این گوشی اصل بعد تقلبی نیست اگه تقلبی بو د من چیکار کنم بعد همه چیزش اوکی‌ هست',
                                   'ریجستر شده اگه نشده هزینه ریجسترش چند میشه ؟؟؟',
                            ],
                            breadCrumb: [
                                   'راد کالا',
                                   'موبایل',
                                   'گوشی موبایل',
                            ],
                     },
              ]
       },
       laptops: [
              {
                     id: 1,
                     cardName: 'لپ تاپ 13.3 اینچی اپل مدل MacBook Air MGN63 2020 LLA',
                     name: 'لپ تاپ 13.3 اینچی اپل مدل MacBook Air MGN63 2020 LLA',

                     price: 44490000,
                     rate: 4.4,
                     comments: [
                            {
                                   title: 'چند روز پیش با تخفیف یک میلیون و هشتصد هزار تومانی شگفت انگیزش کردید تا من پولم جور بشه برای خریدش از شگفت انگیز خارجش کردید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'بدون مشکل به دستم رسید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'خیلی خوبه همه ی بازی ها را بالا می آورد',
                                   rate: 5
                            }

                     ],
                     propertys: [
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'ظرفیت حافظه RAM', subtitle:'هشت گیگابایت' },
                            { title: 'ظرفیت حافظه داخلی', subtitle: '256 گیگابایت' },
                            { title: 'سازنده پردازنده گرافیکی', subtitle: 'Apple' },
                            { title: 'دقت صفحه نمایش', subtitle: 'QHD|2560x1600' },
                     ],
                     moreInfo: {
                            title: 'مک بوک ایر',
                            text: 'موردانتظارترین و تأثیرگذارترین رویداد اپل در سال 2020، نخستین کامپیوتر‌های مک با پردازنده‌ی اختصاصی این شرکت را به‌ارمغان آورد. مک‌بوک ایر نخستین لپ‌تاپ اپل با پردازنده‌ی مبتنی‌بر ARM کوپرتینونشین‌ها موسوم به M1 خواهد بود.همان‌طور که انتظار می‌رفت مک‌بوک ایر به‌لحاظ ظاهر و طراحی هیچ تفاوتی با نسخه‌ی اینتل ندارد و همانند گذشته است. تغییرات اصلی مک‌ بوک ایر در داخل آن رخ می‌دهد؛ جایی‌که تراشه اختصاصی M1 توان پردازشی موردنیاز کاربر را با بهره‌وری بالاتر و مصرف انرژی کمتر فراهم می‌سازد. این تراشه در دو نسخه‌ با گرافیک 7 یا 8 هسته‌ای درون مک بوک ایر به‌کار می‌رود؛ اما در هر دو نسخه، پردازنده‌ی مرکزی 8 هسته‌ای و واحد پردازش عصبی 16 هسته‌ای دردسترس هستند. به‌مدد بهینگی بسیار بیشتر تراشه‌‌ی اختصاصی M1، کوپرتینونشین‌ها مک‌ بوک ایر را با سیستم خنک‌کننده‌ی پسیو (بدون فن) تولید می‌کنند.اپل می‌گوید CPU داخل تراشه‌ی M1 به‌مدد 4 هسته‌ی قدرتمند و 4 هسته‌ی کم‌مصرفش در مجموع بالغ‌بر 3٫5 برابر و GPU هشت هسته‌ای آن نیز تا 5 برابر سریع‌تر از نسل گذشته عمل می‌کنند. از سوی دیگر به‌لطف واحد پردازش عصبی 16 هسته‌ای M1 پردازش‌های مبتنی‌بر یادگیری ماشین نظیر تشخیص چهره یا شناسایی اجسام تا 9 برابر سریع‌تر صورت می‌گیرد. براساس ادعای اپل، تراشه‌ی M1 موجود در داخل مک بوک ایر از «98 درصد لپ‌تاپ‌های فروخته‌شده در سال گذشته» سریع‌تر است. اپل می‌گوید به‌لطف کنترلر حافظه‌ی موجود در M1 و حافظه‌های جدید، ماژول‌های SSD مک‌بوک ایر بالغ‌بر 2 برابر سریع‌تر از گذشته هستند.اولترابوک محبوب اپل جک 3٫5 میلی‌متری هدفون و دو پورت USB 4 با پشتیبانی از USB 3.1 Gen 2 (پهنای باند 10 گیگابیت‌برثانیه) و تاندربولت 3 (پهنای باند 40 گیگابیت‌برثانیه) را دراختیار کاربر می‌گذارد. این پورت‌‌ها هم‌اکنون از گرافیک اکسترنال پشتیبانی نمی‌کنند؛ اما به‌کمک آن‌ها می‌توان یک نمایشگر اکسترنال با وضوح 6K و نرخ نوسازی 60 هرتز را به مک‌بوک ایر متصل کرد.مک بوک ایر اسپیکرهای استریو با پشتیبانی از دالبی اتموس، ماژول Wi-Fi 6 و بلوتوث 5 را در بطن خود دارد. این لپ‌تاپ همانند گذشته از وب‌کم 720p استفاده می‌کند؛ اما اکنون به‌لطف پردازنده‌ی سیگنال تصویر داخل تراشه‌ی M1 تصاویر را با نویز کمتر و گستره‌ی دینامیکی وسیع‌تری ثبت می‌کند.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۱.۲۹ کیلوگرم' },
                            { title: 'ابعاد', subtitle:'۳۰۴.۱x۲۱۲.۴x۱۶.۱ میلی‌متر' },
                            { title: 'سازنده پردازنده', subtitle: 'Apple' },
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'مدل پردازنده', subtitle: 'Apple M۱ chip' },
                     ],
                     questions: [
                            'سلام چرا لپتاب من زود شارژش تموم میشه تو یک ساعت تقریبا 15 درصد رفت،',
                            'سلام این لپ تاپ برای دانش آموز و ... مناسب است؟',
                            'وقتی بدستمون میرسه روشنش کنیم یا شارژ شه بعد روشن کنیم؟؟؟؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'لپ تاپ',
                     ],
              },
              {
                     id: 2,
                     cardName:'لپ تاپ 13.6 اینچی اپل مدل MacBook Air-B M2 2022',
                     name: 'لپ تاپ 13.6 اینچی اپل مدل MacBook Air-B M2 2022',

                     price: 56490000,
                     rate: 4.1,
                     comments: [
                            {
                                   title: 'چند روز پیش با تخفیف یک میلیون و هشتصد هزار تومانی شگفت انگیزش کردید تا من پولم جور بشه برای خریدش از شگفت انگیز خارجش کردید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'بدون مشکل به دستم رسید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'خیلی خوبه همه ی بازی ها را بالا می آورد',
                                   rate: 5
                            }

                     ],
                     propertys: [
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'ظرفیت حافظه RAM', subtitle:'هشت گیگابایت' },
                            { title: 'ظرفیت حافظه داخلی', subtitle: '256 گیگابایت' },
                            { title: 'سازنده پردازنده گرافیکی', subtitle: 'Apple' },
                            { title: 'دقت صفحه نمایش', subtitle: 'QHD|2560x1600' },
                     ],
                     moreInfo: {
                            title: 'مک بوک ایر',
                            text: 'موردانتظارترین و تأثیرگذارترین رویداد اپل در سال 2020، نخستین کامپیوتر‌های مک با پردازنده‌ی اختصاصی این شرکت را به‌ارمغان آورد. مک‌بوک ایر نخستین لپ‌تاپ اپل با پردازنده‌ی مبتنی‌بر ARM کوپرتینونشین‌ها موسوم به M1 خواهد بود.همان‌طور که انتظار می‌رفت مک‌بوک ایر به‌لحاظ ظاهر و طراحی هیچ تفاوتی با نسخه‌ی اینتل ندارد و همانند گذشته است. تغییرات اصلی مک‌ بوک ایر در داخل آن رخ می‌دهد؛ جایی‌که تراشه اختصاصی M1 توان پردازشی موردنیاز کاربر را با بهره‌وری بالاتر و مصرف انرژی کمتر فراهم می‌سازد. این تراشه در دو نسخه‌ با گرافیک 7 یا 8 هسته‌ای درون مک بوک ایر به‌کار می‌رود؛ اما در هر دو نسخه، پردازنده‌ی مرکزی 8 هسته‌ای و واحد پردازش عصبی 16 هسته‌ای دردسترس هستند. به‌مدد بهینگی بسیار بیشتر تراشه‌‌ی اختصاصی M1، کوپرتینونشین‌ها مک‌ بوک ایر را با سیستم خنک‌کننده‌ی پسیو (بدون فن) تولید می‌کنند.اپل می‌گوید CPU داخل تراشه‌ی M1 به‌مدد 4 هسته‌ی قدرتمند و 4 هسته‌ی کم‌مصرفش در مجموع بالغ‌بر 3٫5 برابر و GPU هشت هسته‌ای آن نیز تا 5 برابر سریع‌تر از نسل گذشته عمل می‌کنند. از سوی دیگر به‌لطف واحد پردازش عصبی 16 هسته‌ای M1 پردازش‌های مبتنی‌بر یادگیری ماشین نظیر تشخیص چهره یا شناسایی اجسام تا 9 برابر سریع‌تر صورت می‌گیرد. براساس ادعای اپل، تراشه‌ی M1 موجود در داخل مک بوک ایر از «98 درصد لپ‌تاپ‌های فروخته‌شده در سال گذشته» سریع‌تر است. اپل می‌گوید به‌لطف کنترلر حافظه‌ی موجود در M1 و حافظه‌های جدید، ماژول‌های SSD مک‌بوک ایر بالغ‌بر 2 برابر سریع‌تر از گذشته هستند.اولترابوک محبوب اپل جک 3٫5 میلی‌متری هدفون و دو پورت USB 4 با پشتیبانی از USB 3.1 Gen 2 (پهنای باند 10 گیگابیت‌برثانیه) و تاندربولت 3 (پهنای باند 40 گیگابیت‌برثانیه) را دراختیار کاربر می‌گذارد. این پورت‌‌ها هم‌اکنون از گرافیک اکسترنال پشتیبانی نمی‌کنند؛ اما به‌کمک آن‌ها می‌توان یک نمایشگر اکسترنال با وضوح 6K و نرخ نوسازی 60 هرتز را به مک‌بوک ایر متصل کرد.مک بوک ایر اسپیکرهای استریو با پشتیبانی از دالبی اتموس، ماژول Wi-Fi 6 و بلوتوث 5 را در بطن خود دارد. این لپ‌تاپ همانند گذشته از وب‌کم 720p استفاده می‌کند؛ اما اکنون به‌لطف پردازنده‌ی سیگنال تصویر داخل تراشه‌ی M1 تصاویر را با نویز کمتر و گستره‌ی دینامیکی وسیع‌تری ثبت می‌کند.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۱.۲۹ کیلوگرم' },
                            { title: 'ابعاد', subtitle:'۳۰۴.۱x۲۱۲.۴x۱۶.۱ میلی‌متر' },
                            { title: 'سازنده پردازنده', subtitle: 'Apple' },
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'مدل پردازنده', subtitle: 'Apple M۱ chip' },
                     ],
                     questions: [
                            'سلام چرا لپتاب من زود شارژش تموم میشه تو یک ساعت تقریبا 15 درصد رفت،',
                            'سلام این لپ تاپ برای دانش آموز و ... مناسب است؟',
                            'وقتی بدستمون میرسه روشنش کنیم یا شارژ شه بعد روشن کنیم؟؟؟؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'لپ تاپ',
                     ],
              },
              {
                     id: 3,
                     cardName:'لپ تاپ 14.1 اینچی ایسوس مدل Vivobook R465EA-EB1592',
                     name: 'لپ تاپ 14.1 اینچی ایسوس مدل Vivobook R465EA-EB1592',

                     price: 18990000,
                     rate: 4.1,
                     comments: [
                            {
                                   title: 'چند روز پیش با تخفیف یک میلیون و هشتصد هزار تومانی شگفت انگیزش کردید تا من پولم جور بشه برای خریدش از شگفت انگیز خارجش کردید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'بدون مشکل به دستم رسید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'خیلی خوبه همه ی بازی ها را بالا می آورد',
                                   rate: 5
                            }

                     ],
                     propertys: [
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'ظرفیت حافظه RAM', subtitle:'هشت گیگابایت' },
                            { title: 'ظرفیت حافظه داخلی', subtitle: '256 گیگابایت' },
                            { title: 'سازنده پردازنده گرافیکی', subtitle: 'Apple' },
                            { title: 'دقت صفحه نمایش', subtitle: 'QHD|2560x1600' },
                     ],
                     moreInfo: {
                            title: 'مک بوک ایر',
                            text: 'موردانتظارترین و تأثیرگذارترین رویداد اپل در سال 2020، نخستین کامپیوتر‌های مک با پردازنده‌ی اختصاصی این شرکت را به‌ارمغان آورد. مک‌بوک ایر نخستین لپ‌تاپ اپل با پردازنده‌ی مبتنی‌بر ARM کوپرتینونشین‌ها موسوم به M1 خواهد بود.همان‌طور که انتظار می‌رفت مک‌بوک ایر به‌لحاظ ظاهر و طراحی هیچ تفاوتی با نسخه‌ی اینتل ندارد و همانند گذشته است. تغییرات اصلی مک‌ بوک ایر در داخل آن رخ می‌دهد؛ جایی‌که تراشه اختصاصی M1 توان پردازشی موردنیاز کاربر را با بهره‌وری بالاتر و مصرف انرژی کمتر فراهم می‌سازد. این تراشه در دو نسخه‌ با گرافیک 7 یا 8 هسته‌ای درون مک بوک ایر به‌کار می‌رود؛ اما در هر دو نسخه، پردازنده‌ی مرکزی 8 هسته‌ای و واحد پردازش عصبی 16 هسته‌ای دردسترس هستند. به‌مدد بهینگی بسیار بیشتر تراشه‌‌ی اختصاصی M1، کوپرتینونشین‌ها مک‌ بوک ایر را با سیستم خنک‌کننده‌ی پسیو (بدون فن) تولید می‌کنند.اپل می‌گوید CPU داخل تراشه‌ی M1 به‌مدد 4 هسته‌ی قدرتمند و 4 هسته‌ی کم‌مصرفش در مجموع بالغ‌بر 3٫5 برابر و GPU هشت هسته‌ای آن نیز تا 5 برابر سریع‌تر از نسل گذشته عمل می‌کنند. از سوی دیگر به‌لطف واحد پردازش عصبی 16 هسته‌ای M1 پردازش‌های مبتنی‌بر یادگیری ماشین نظیر تشخیص چهره یا شناسایی اجسام تا 9 برابر سریع‌تر صورت می‌گیرد. براساس ادعای اپل، تراشه‌ی M1 موجود در داخل مک بوک ایر از «98 درصد لپ‌تاپ‌های فروخته‌شده در سال گذشته» سریع‌تر است. اپل می‌گوید به‌لطف کنترلر حافظه‌ی موجود در M1 و حافظه‌های جدید، ماژول‌های SSD مک‌بوک ایر بالغ‌بر 2 برابر سریع‌تر از گذشته هستند.اولترابوک محبوب اپل جک 3٫5 میلی‌متری هدفون و دو پورت USB 4 با پشتیبانی از USB 3.1 Gen 2 (پهنای باند 10 گیگابیت‌برثانیه) و تاندربولت 3 (پهنای باند 40 گیگابیت‌برثانیه) را دراختیار کاربر می‌گذارد. این پورت‌‌ها هم‌اکنون از گرافیک اکسترنال پشتیبانی نمی‌کنند؛ اما به‌کمک آن‌ها می‌توان یک نمایشگر اکسترنال با وضوح 6K و نرخ نوسازی 60 هرتز را به مک‌بوک ایر متصل کرد.مک بوک ایر اسپیکرهای استریو با پشتیبانی از دالبی اتموس، ماژول Wi-Fi 6 و بلوتوث 5 را در بطن خود دارد. این لپ‌تاپ همانند گذشته از وب‌کم 720p استفاده می‌کند؛ اما اکنون به‌لطف پردازنده‌ی سیگنال تصویر داخل تراشه‌ی M1 تصاویر را با نویز کمتر و گستره‌ی دینامیکی وسیع‌تری ثبت می‌کند.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۱.۲۹ کیلوگرم' },
                            { title: 'ابعاد', subtitle:'۳۰۴.۱x۲۱۲.۴x۱۶.۱ میلی‌متر' },
                            { title: 'سازنده پردازنده', subtitle: 'Apple' },
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'مدل پردازنده', subtitle: 'Apple M۱ chip' },
                     ],
                     questions: [
                            'سلام چرا لپتاب من زود شارژش تموم میشه تو یک ساعت تقریبا 15 درصد رفت،',
                            'سلام این لپ تاپ برای دانش آموز و ... مناسب است؟',
                            'وقتی بدستمون میرسه روشنش کنیم یا شارژ شه بعد روشن کنیم؟؟؟؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'لپ تاپ',
                     ],
                     
              },
              {
                     id: 4,
                     cardName:'لپ تاپ 15.6 اینچی ایسوس مدل R565EP-EJ617',
                     name: 'لپ تاپ 15.6 اینچی ایسوس مدل R565EP-EJ617',

                     price: 27400000,
                     rate: 3.9,
                     comments: [
                            {
                                   title: 'چند روز پیش با تخفیف یک میلیون و هشتصد هزار تومانی شگفت انگیزش کردید تا من پولم جور بشه برای خریدش از شگفت انگیز خارجش کردید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'بدون مشکل به دستم رسید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'خیلی خوبه همه ی بازی ها را بالا می آورد',
                                   rate: 5
                            }

                     ],
                     propertys: [
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'ظرفیت حافظه RAM', subtitle:'هشت گیگابایت' },
                            { title: 'ظرفیت حافظه داخلی', subtitle: '256 گیگابایت' },
                            { title: 'سازنده پردازنده گرافیکی', subtitle: 'Apple' },
                            { title: 'دقت صفحه نمایش', subtitle: 'QHD|2560x1600' },
                     ],
                     moreInfo: {
                            title: 'مک بوک ایر',
                            text: 'موردانتظارترین و تأثیرگذارترین رویداد اپل در سال 2020، نخستین کامپیوتر‌های مک با پردازنده‌ی اختصاصی این شرکت را به‌ارمغان آورد. مک‌بوک ایر نخستین لپ‌تاپ اپل با پردازنده‌ی مبتنی‌بر ARM کوپرتینونشین‌ها موسوم به M1 خواهد بود.همان‌طور که انتظار می‌رفت مک‌بوک ایر به‌لحاظ ظاهر و طراحی هیچ تفاوتی با نسخه‌ی اینتل ندارد و همانند گذشته است. تغییرات اصلی مک‌ بوک ایر در داخل آن رخ می‌دهد؛ جایی‌که تراشه اختصاصی M1 توان پردازشی موردنیاز کاربر را با بهره‌وری بالاتر و مصرف انرژی کمتر فراهم می‌سازد. این تراشه در دو نسخه‌ با گرافیک 7 یا 8 هسته‌ای درون مک بوک ایر به‌کار می‌رود؛ اما در هر دو نسخه، پردازنده‌ی مرکزی 8 هسته‌ای و واحد پردازش عصبی 16 هسته‌ای دردسترس هستند. به‌مدد بهینگی بسیار بیشتر تراشه‌‌ی اختصاصی M1، کوپرتینونشین‌ها مک‌ بوک ایر را با سیستم خنک‌کننده‌ی پسیو (بدون فن) تولید می‌کنند.اپل می‌گوید CPU داخل تراشه‌ی M1 به‌مدد 4 هسته‌ی قدرتمند و 4 هسته‌ی کم‌مصرفش در مجموع بالغ‌بر 3٫5 برابر و GPU هشت هسته‌ای آن نیز تا 5 برابر سریع‌تر از نسل گذشته عمل می‌کنند. از سوی دیگر به‌لطف واحد پردازش عصبی 16 هسته‌ای M1 پردازش‌های مبتنی‌بر یادگیری ماشین نظیر تشخیص چهره یا شناسایی اجسام تا 9 برابر سریع‌تر صورت می‌گیرد. براساس ادعای اپل، تراشه‌ی M1 موجود در داخل مک بوک ایر از «98 درصد لپ‌تاپ‌های فروخته‌شده در سال گذشته» سریع‌تر است. اپل می‌گوید به‌لطف کنترلر حافظه‌ی موجود در M1 و حافظه‌های جدید، ماژول‌های SSD مک‌بوک ایر بالغ‌بر 2 برابر سریع‌تر از گذشته هستند.اولترابوک محبوب اپل جک 3٫5 میلی‌متری هدفون و دو پورت USB 4 با پشتیبانی از USB 3.1 Gen 2 (پهنای باند 10 گیگابیت‌برثانیه) و تاندربولت 3 (پهنای باند 40 گیگابیت‌برثانیه) را دراختیار کاربر می‌گذارد. این پورت‌‌ها هم‌اکنون از گرافیک اکسترنال پشتیبانی نمی‌کنند؛ اما به‌کمک آن‌ها می‌توان یک نمایشگر اکسترنال با وضوح 6K و نرخ نوسازی 60 هرتز را به مک‌بوک ایر متصل کرد.مک بوک ایر اسپیکرهای استریو با پشتیبانی از دالبی اتموس، ماژول Wi-Fi 6 و بلوتوث 5 را در بطن خود دارد. این لپ‌تاپ همانند گذشته از وب‌کم 720p استفاده می‌کند؛ اما اکنون به‌لطف پردازنده‌ی سیگنال تصویر داخل تراشه‌ی M1 تصاویر را با نویز کمتر و گستره‌ی دینامیکی وسیع‌تری ثبت می‌کند.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۱.۲۹ کیلوگرم' },
                            { title: 'ابعاد', subtitle:'۳۰۴.۱x۲۱۲.۴x۱۶.۱ میلی‌متر' },
                            { title: 'سازنده پردازنده', subtitle: 'Apple' },
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'مدل پردازنده', subtitle: 'Apple M۱ chip' },
                     ],
                     questions: [
                            'سلام چرا لپتاب من زود شارژش تموم میشه تو یک ساعت تقریبا 15 درصد رفت،',
                            'سلام این لپ تاپ برای دانش آموز و ... مناسب است؟',
                            'وقتی بدستمون میرسه روشنش کنیم یا شارژ شه بعد روشن کنیم؟؟؟؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'لپ تاپ',
                     ],
                     
              },
              {
                     id: 5,
                     cardName:'لپ تاپ 12.4 اینچی مایکروسافت مدل Surface Laptop Go-i5 16GB 256SSD',
                     name: 'لپ تاپ 12.4 اینچی مایکروسافت مدل Surface Laptop Go-i5 16GB 256SSD',

                     price: 35200000,
                     rate: 4,
                     comments: [
                            {
                                   title: 'چند روز پیش با تخفیف یک میلیون و هشتصد هزار تومانی شگفت انگیزش کردید تا من پولم جور بشه برای خریدش از شگفت انگیز خارجش کردید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'بدون مشکل به دستم رسید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'خیلی خوبه همه ی بازی ها را بالا می آورد',
                                   rate: 5
                            }

                     ],
                     propertys: [
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'ظرفیت حافظه RAM', subtitle:'هشت گیگابایت' },
                            { title: 'ظرفیت حافظه داخلی', subtitle: '256 گیگابایت' },
                            { title: 'سازنده پردازنده گرافیکی', subtitle: 'Apple' },
                            { title: 'دقت صفحه نمایش', subtitle: 'QHD|2560x1600' },
                     ],
                     moreInfo: {
                            title: 'مک بوک ایر',
                            text: 'موردانتظارترین و تأثیرگذارترین رویداد اپل در سال 2020، نخستین کامپیوتر‌های مک با پردازنده‌ی اختصاصی این شرکت را به‌ارمغان آورد. مک‌بوک ایر نخستین لپ‌تاپ اپل با پردازنده‌ی مبتنی‌بر ARM کوپرتینونشین‌ها موسوم به M1 خواهد بود.همان‌طور که انتظار می‌رفت مک‌بوک ایر به‌لحاظ ظاهر و طراحی هیچ تفاوتی با نسخه‌ی اینتل ندارد و همانند گذشته است. تغییرات اصلی مک‌ بوک ایر در داخل آن رخ می‌دهد؛ جایی‌که تراشه اختصاصی M1 توان پردازشی موردنیاز کاربر را با بهره‌وری بالاتر و مصرف انرژی کمتر فراهم می‌سازد. این تراشه در دو نسخه‌ با گرافیک 7 یا 8 هسته‌ای درون مک بوک ایر به‌کار می‌رود؛ اما در هر دو نسخه، پردازنده‌ی مرکزی 8 هسته‌ای و واحد پردازش عصبی 16 هسته‌ای دردسترس هستند. به‌مدد بهینگی بسیار بیشتر تراشه‌‌ی اختصاصی M1، کوپرتینونشین‌ها مک‌ بوک ایر را با سیستم خنک‌کننده‌ی پسیو (بدون فن) تولید می‌کنند.اپل می‌گوید CPU داخل تراشه‌ی M1 به‌مدد 4 هسته‌ی قدرتمند و 4 هسته‌ی کم‌مصرفش در مجموع بالغ‌بر 3٫5 برابر و GPU هشت هسته‌ای آن نیز تا 5 برابر سریع‌تر از نسل گذشته عمل می‌کنند. از سوی دیگر به‌لطف واحد پردازش عصبی 16 هسته‌ای M1 پردازش‌های مبتنی‌بر یادگیری ماشین نظیر تشخیص چهره یا شناسایی اجسام تا 9 برابر سریع‌تر صورت می‌گیرد. براساس ادعای اپل، تراشه‌ی M1 موجود در داخل مک بوک ایر از «98 درصد لپ‌تاپ‌های فروخته‌شده در سال گذشته» سریع‌تر است. اپل می‌گوید به‌لطف کنترلر حافظه‌ی موجود در M1 و حافظه‌های جدید، ماژول‌های SSD مک‌بوک ایر بالغ‌بر 2 برابر سریع‌تر از گذشته هستند.اولترابوک محبوب اپل جک 3٫5 میلی‌متری هدفون و دو پورت USB 4 با پشتیبانی از USB 3.1 Gen 2 (پهنای باند 10 گیگابیت‌برثانیه) و تاندربولت 3 (پهنای باند 40 گیگابیت‌برثانیه) را دراختیار کاربر می‌گذارد. این پورت‌‌ها هم‌اکنون از گرافیک اکسترنال پشتیبانی نمی‌کنند؛ اما به‌کمک آن‌ها می‌توان یک نمایشگر اکسترنال با وضوح 6K و نرخ نوسازی 60 هرتز را به مک‌بوک ایر متصل کرد.مک بوک ایر اسپیکرهای استریو با پشتیبانی از دالبی اتموس، ماژول Wi-Fi 6 و بلوتوث 5 را در بطن خود دارد. این لپ‌تاپ همانند گذشته از وب‌کم 720p استفاده می‌کند؛ اما اکنون به‌لطف پردازنده‌ی سیگنال تصویر داخل تراشه‌ی M1 تصاویر را با نویز کمتر و گستره‌ی دینامیکی وسیع‌تری ثبت می‌کند.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۱.۲۹ کیلوگرم' },
                            { title: 'ابعاد', subtitle:'۳۰۴.۱x۲۱۲.۴x۱۶.۱ میلی‌متر' },
                            { title: 'سازنده پردازنده', subtitle: 'Apple' },
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'مدل پردازنده', subtitle: 'Apple M۱ chip' },
                     ],
                     questions: [
                            'سلام چرا لپتاب من زود شارژش تموم میشه تو یک ساعت تقریبا 15 درصد رفت،',
                            'سلام این لپ تاپ برای دانش آموز و ... مناسب است؟',
                            'وقتی بدستمون میرسه روشنش کنیم یا شارژ شه بعد روشن کنیم؟؟؟؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'لپ تاپ',
                     ],
              },
              {
                     id: 6,
                     cardName:'لپ تاپ 15.6 اینچی لنوو مدل IdeaPad 5 15ITL05-i5 8GB 512SSD MX450',
                     name: 'لپ تاپ 15.6 اینچی لنوو مدل IdeaPad 5 15ITL05-i5 8GB 512SSD MX450',

                     price: 26000000,
                     rate: 4.2,
                     comments: [
                            {
                                   title: 'چند روز پیش با تخفیف یک میلیون و هشتصد هزار تومانی شگفت انگیزش کردید تا من پولم جور بشه برای خریدش از شگفت انگیز خارجش کردید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'بدون مشکل به دستم رسید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'خیلی خوبه همه ی بازی ها را بالا می آورد',
                                   rate: 5
                            }

                     ],
                     propertys: [
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'ظرفیت حافظه RAM', subtitle:'هشت گیگابایت' },
                            { title: 'ظرفیت حافظه داخلی', subtitle: '256 گیگابایت' },
                            { title: 'سازنده پردازنده گرافیکی', subtitle: 'Apple' },
                            { title: 'دقت صفحه نمایش', subtitle: 'QHD|2560x1600' },
                     ],
                     moreInfo: {
                            title: 'مک بوک ایر',
                            text: 'موردانتظارترین و تأثیرگذارترین رویداد اپل در سال 2020، نخستین کامپیوتر‌های مک با پردازنده‌ی اختصاصی این شرکت را به‌ارمغان آورد. مک‌بوک ایر نخستین لپ‌تاپ اپل با پردازنده‌ی مبتنی‌بر ARM کوپرتینونشین‌ها موسوم به M1 خواهد بود.همان‌طور که انتظار می‌رفت مک‌بوک ایر به‌لحاظ ظاهر و طراحی هیچ تفاوتی با نسخه‌ی اینتل ندارد و همانند گذشته است. تغییرات اصلی مک‌ بوک ایر در داخل آن رخ می‌دهد؛ جایی‌که تراشه اختصاصی M1 توان پردازشی موردنیاز کاربر را با بهره‌وری بالاتر و مصرف انرژی کمتر فراهم می‌سازد. این تراشه در دو نسخه‌ با گرافیک 7 یا 8 هسته‌ای درون مک بوک ایر به‌کار می‌رود؛ اما در هر دو نسخه، پردازنده‌ی مرکزی 8 هسته‌ای و واحد پردازش عصبی 16 هسته‌ای دردسترس هستند. به‌مدد بهینگی بسیار بیشتر تراشه‌‌ی اختصاصی M1، کوپرتینونشین‌ها مک‌ بوک ایر را با سیستم خنک‌کننده‌ی پسیو (بدون فن) تولید می‌کنند.اپل می‌گوید CPU داخل تراشه‌ی M1 به‌مدد 4 هسته‌ی قدرتمند و 4 هسته‌ی کم‌مصرفش در مجموع بالغ‌بر 3٫5 برابر و GPU هشت هسته‌ای آن نیز تا 5 برابر سریع‌تر از نسل گذشته عمل می‌کنند. از سوی دیگر به‌لطف واحد پردازش عصبی 16 هسته‌ای M1 پردازش‌های مبتنی‌بر یادگیری ماشین نظیر تشخیص چهره یا شناسایی اجسام تا 9 برابر سریع‌تر صورت می‌گیرد. براساس ادعای اپل، تراشه‌ی M1 موجود در داخل مک بوک ایر از «98 درصد لپ‌تاپ‌های فروخته‌شده در سال گذشته» سریع‌تر است. اپل می‌گوید به‌لطف کنترلر حافظه‌ی موجود در M1 و حافظه‌های جدید، ماژول‌های SSD مک‌بوک ایر بالغ‌بر 2 برابر سریع‌تر از گذشته هستند.اولترابوک محبوب اپل جک 3٫5 میلی‌متری هدفون و دو پورت USB 4 با پشتیبانی از USB 3.1 Gen 2 (پهنای باند 10 گیگابیت‌برثانیه) و تاندربولت 3 (پهنای باند 40 گیگابیت‌برثانیه) را دراختیار کاربر می‌گذارد. این پورت‌‌ها هم‌اکنون از گرافیک اکسترنال پشتیبانی نمی‌کنند؛ اما به‌کمک آن‌ها می‌توان یک نمایشگر اکسترنال با وضوح 6K و نرخ نوسازی 60 هرتز را به مک‌بوک ایر متصل کرد.مک بوک ایر اسپیکرهای استریو با پشتیبانی از دالبی اتموس، ماژول Wi-Fi 6 و بلوتوث 5 را در بطن خود دارد. این لپ‌تاپ همانند گذشته از وب‌کم 720p استفاده می‌کند؛ اما اکنون به‌لطف پردازنده‌ی سیگنال تصویر داخل تراشه‌ی M1 تصاویر را با نویز کمتر و گستره‌ی دینامیکی وسیع‌تری ثبت می‌کند.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۱.۲۹ کیلوگرم' },
                            { title: 'ابعاد', subtitle:'۳۰۴.۱x۲۱۲.۴x۱۶.۱ میلی‌متر' },
                            { title: 'سازنده پردازنده', subtitle: 'Apple' },
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'مدل پردازنده', subtitle: 'Apple M۱ chip' },
                     ],
                     questions: [
                            'سلام چرا لپتاب من زود شارژش تموم میشه تو یک ساعت تقریبا 15 درصد رفت،',
                            'سلام این لپ تاپ برای دانش آموز و ... مناسب است؟',
                            'وقتی بدستمون میرسه روشنش کنیم یا شارژ شه بعد روشن کنیم؟؟؟؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'لپ تاپ',
                     ],
           
              },
              {
                     id: 7,
                     cardName:'لپ تاپ 14.2 اینچی اپل مدل 2023 MacBook Pro MPHG3',
                     name: 'لپ تاپ 14.2 اینچی اپل مدل 2023 MacBook Pro MPHG3',

                     price: 179790000,
                     rate: 4.2,
                     comments: [
                            {
                                   title: 'چند روز پیش با تخفیف یک میلیون و هشتصد هزار تومانی شگفت انگیزش کردید تا من پولم جور بشه برای خریدش از شگفت انگیز خارجش کردید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'بدون مشکل به دستم رسید',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'خیلی خوبه همه ی بازی ها را بالا می آورد',
                                   rate: 5
                            }

                     ],
                     propertys: [
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'ظرفیت حافظه RAM', subtitle:'هشت گیگابایت' },
                            { title: 'ظرفیت حافظه داخلی', subtitle: '256 گیگابایت' },
                            { title: 'سازنده پردازنده گرافیکی', subtitle: 'Apple' },
                            { title: 'دقت صفحه نمایش', subtitle: 'QHD|2560x1600' },
                     ],
                     moreInfo: {
                            title: 'مک بوک ایر',
                            text: 'موردانتظارترین و تأثیرگذارترین رویداد اپل در سال 2020، نخستین کامپیوتر‌های مک با پردازنده‌ی اختصاصی این شرکت را به‌ارمغان آورد. مک‌بوک ایر نخستین لپ‌تاپ اپل با پردازنده‌ی مبتنی‌بر ARM کوپرتینونشین‌ها موسوم به M1 خواهد بود.همان‌طور که انتظار می‌رفت مک‌بوک ایر به‌لحاظ ظاهر و طراحی هیچ تفاوتی با نسخه‌ی اینتل ندارد و همانند گذشته است. تغییرات اصلی مک‌ بوک ایر در داخل آن رخ می‌دهد؛ جایی‌که تراشه اختصاصی M1 توان پردازشی موردنیاز کاربر را با بهره‌وری بالاتر و مصرف انرژی کمتر فراهم می‌سازد. این تراشه در دو نسخه‌ با گرافیک 7 یا 8 هسته‌ای درون مک بوک ایر به‌کار می‌رود؛ اما در هر دو نسخه، پردازنده‌ی مرکزی 8 هسته‌ای و واحد پردازش عصبی 16 هسته‌ای دردسترس هستند. به‌مدد بهینگی بسیار بیشتر تراشه‌‌ی اختصاصی M1، کوپرتینونشین‌ها مک‌ بوک ایر را با سیستم خنک‌کننده‌ی پسیو (بدون فن) تولید می‌کنند.اپل می‌گوید CPU داخل تراشه‌ی M1 به‌مدد 4 هسته‌ی قدرتمند و 4 هسته‌ی کم‌مصرفش در مجموع بالغ‌بر 3٫5 برابر و GPU هشت هسته‌ای آن نیز تا 5 برابر سریع‌تر از نسل گذشته عمل می‌کنند. از سوی دیگر به‌لطف واحد پردازش عصبی 16 هسته‌ای M1 پردازش‌های مبتنی‌بر یادگیری ماشین نظیر تشخیص چهره یا شناسایی اجسام تا 9 برابر سریع‌تر صورت می‌گیرد. براساس ادعای اپل، تراشه‌ی M1 موجود در داخل مک بوک ایر از «98 درصد لپ‌تاپ‌های فروخته‌شده در سال گذشته» سریع‌تر است. اپل می‌گوید به‌لطف کنترلر حافظه‌ی موجود در M1 و حافظه‌های جدید، ماژول‌های SSD مک‌بوک ایر بالغ‌بر 2 برابر سریع‌تر از گذشته هستند.اولترابوک محبوب اپل جک 3٫5 میلی‌متری هدفون و دو پورت USB 4 با پشتیبانی از USB 3.1 Gen 2 (پهنای باند 10 گیگابیت‌برثانیه) و تاندربولت 3 (پهنای باند 40 گیگابیت‌برثانیه) را دراختیار کاربر می‌گذارد. این پورت‌‌ها هم‌اکنون از گرافیک اکسترنال پشتیبانی نمی‌کنند؛ اما به‌کمک آن‌ها می‌توان یک نمایشگر اکسترنال با وضوح 6K و نرخ نوسازی 60 هرتز را به مک‌بوک ایر متصل کرد.مک بوک ایر اسپیکرهای استریو با پشتیبانی از دالبی اتموس، ماژول Wi-Fi 6 و بلوتوث 5 را در بطن خود دارد. این لپ‌تاپ همانند گذشته از وب‌کم 720p استفاده می‌کند؛ اما اکنون به‌لطف پردازنده‌ی سیگنال تصویر داخل تراشه‌ی M1 تصاویر را با نویز کمتر و گستره‌ی دینامیکی وسیع‌تری ثبت می‌کند.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۱.۲۹ کیلوگرم' },
                            { title: 'ابعاد', subtitle:'۳۰۴.۱x۲۱۲.۴x۱۶.۱ میلی‌متر' },
                            { title: 'سازنده پردازنده', subtitle: 'Apple' },
                            { title: 'سری پردازنده', subtitle: 'M1' },
                            { title: 'مدل پردازنده', subtitle: 'Apple M۱ chip' },
                     ],
                     questions: [
                            'سلام چرا لپتاب من زود شارژش تموم میشه تو یک ساعت تقریبا 15 درصد رفت،',
                            'سلام این لپ تاپ برای دانش آموز و ... مناسب است؟',
                            'وقتی بدستمون میرسه روشنش کنیم یا شارژ شه بعد روشن کنیم؟؟؟؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'لپ تاپ',
                     ],
                   
              },
       ],
       hardExternal: [
              {
                     id: 1,
                     cardName:'هارد اکسترنال ای دیتا مدل HD770G ظرفیت 2 ترابایت',
                     name: 'هارد اکسترنال ای دیتا مدل HD770G ظرفیت 2 ترابایت',

                     price: 4280000,
                     rate: 4.4,
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:true},
                     ],
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'سه سال پیش یه ترابایتشو خریدم الانم دو ترابایتشو گرفتم خیلی راضیم پیشنهاد میشه',
                                   rate: 5
                            }

                     ],
                     propertys: [
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle:'مقاوم در برابر گرد و غبار' },
                            
                     ],
                     moreInfo: {
                            title: 'هارد اکسترنال',
                            text: 'با استفاده از HD770G می توانید تمام بازی ها و اطلاعات خود را ذخیره کنید. علاوه بر این HD770G دارای استاندارد IP68 و این بدان معناست که نه تنها دارای بدنه سه لایه مقاوم است بلکه در برابر آب، گرد و غبار و شوک هم مقاوم است. از یک هارد اکسترنال نمی توان انتظاری بیش از این داشت (استاندارد IP68 به معنی مقاومت در برابر ورود گرد و غبار و مایعات به درون هارد دیسک است). HD770G حتی فراتر از استانداردهای IP68 از اطلاعات شما در برابر آب و گرد و غبار محافظت می کند. به صورت خاص می تواند 120 دقیقه در عمق 2 متری آب مقاومت کند. HD770G طوری طراحی شده است که مانند یک جنگجو سخت باشد! با رعایت استاندارد MIL-STD-810G 516.6 ، این هارددیسک اکسترنال می تواند از سقوط های ناگهانی از ارتفاع 1.22 متر جان سالم به در ببرد و از اطلاعات ذخیره شده محافظت کند. می توانید فضای ذخیره سازی محدود روی کنسول های بازی خود را، با استفاده از HD770G و فضای زیاد برای ذخیره سازی بازی های خود جبران کنید. این هارد اکسترنال نه تنها برای بازی های کنسولی بسیار کارآمد است بلکه برای بازی های کامپیوتری هم گزینه بسیار مناسبی است. برخلاف درپوش هاردهای اکسترنال دیگر که به زحمت بسته می شوند درپوش HD770G به راحتی بسته می شود و از دستگاه در برابر نفود آب محافظت می کند. هارد دیسک های اکسترنال جدید HD770G، طراحی بسیار زیبایی دارند که به این سادگی نمی توانید از آنها عبور کنید. بر روی هارد دیسک نوارهای LED RGB نصب شده است که زیبایی آنها را دو چندان می کند. البته HD770G با رمز گذاری 256 بیتی AES طراحی شده اند که حفاظت از داده ها را بهبود می بخشد. هرآنچه که بخواهید، در خانواده HD770G خواهید یافت'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۲۷۰ گرم' },
                            { title: 'سایر قابلیت‌ها', subtitle:'دارای چراغ RGB' },
                            { title: 'نوع اتصال', subtitle: 'باسیم' },
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle: 'مقاوم در برابر گرد و غبار' },
                     ],
                     questions: [
                            'چرا داخل لپتاپ ظرفیتش رو ۱.۸۱ نشون میده نه ۲ ترا طبیعیه؟',
                            'سلام کی رنگ سیاه رو موجود میکنید؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'هارد اکسترنال',
                     ],
              },
              {
                     id: 2,
                       cardName:'هارد اکسترنال ای دیتا مدل HD710 Pro ظرفیت 1 ترابایت',
                     name: 'هارد اکسترنال ای دیتا مدل HD710 Pro ظرفیت 1 ترابایت',

                     price: 2670000,
                     rate: 4.3,
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:false},
                            {title:'قرمز',subTitle:'red',ordered:true},
                            {title:'آبی',subTitle:'lightskyblue',ordered:false},
                            {title:'زرد',subTitle:'yellow',ordered:false},
                            {title:'قهوه ای',subTitle:'brown',ordered:false},
                     ],
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'سه سال پیش یه ترابایتشو خریدم الانم دو ترابایتشو گرفتم خیلی راضیم پیشنهاد میشه',
                                   rate: 5
                            }

                     ],
                     propertys: [
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle:'مقاوم در برابر گرد و غبار' },
                            
                     ],
                     moreInfo: {
                            title: 'هارد اکسترنال',
                            text: 'با استفاده از HD770G می توانید تمام بازی ها و اطلاعات خود را ذخیره کنید. علاوه بر این HD770G دارای استاندارد IP68 و این بدان معناست که نه تنها دارای بدنه سه لایه مقاوم است بلکه در برابر آب، گرد و غبار و شوک هم مقاوم است. از یک هارد اکسترنال نمی توان انتظاری بیش از این داشت (استاندارد IP68 به معنی مقاومت در برابر ورود گرد و غبار و مایعات به درون هارد دیسک است). HD770G حتی فراتر از استانداردهای IP68 از اطلاعات شما در برابر آب و گرد و غبار محافظت می کند. به صورت خاص می تواند 120 دقیقه در عمق 2 متری آب مقاومت کند. HD770G طوری طراحی شده است که مانند یک جنگجو سخت باشد! با رعایت استاندارد MIL-STD-810G 516.6 ، این هارددیسک اکسترنال می تواند از سقوط های ناگهانی از ارتفاع 1.22 متر جان سالم به در ببرد و از اطلاعات ذخیره شده محافظت کند. می توانید فضای ذخیره سازی محدود روی کنسول های بازی خود را، با استفاده از HD770G و فضای زیاد برای ذخیره سازی بازی های خود جبران کنید. این هارد اکسترنال نه تنها برای بازی های کنسولی بسیار کارآمد است بلکه برای بازی های کامپیوتری هم گزینه بسیار مناسبی است. برخلاف درپوش هاردهای اکسترنال دیگر که به زحمت بسته می شوند درپوش HD770G به راحتی بسته می شود و از دستگاه در برابر نفود آب محافظت می کند. هارد دیسک های اکسترنال جدید HD770G، طراحی بسیار زیبایی دارند که به این سادگی نمی توانید از آنها عبور کنید. بر روی هارد دیسک نوارهای LED RGB نصب شده است که زیبایی آنها را دو چندان می کند. البته HD770G با رمز گذاری 256 بیتی AES طراحی شده اند که حفاظت از داده ها را بهبود می بخشد. هرآنچه که بخواهید، در خانواده HD770G خواهید یافت'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۲۷۰ گرم' },
                            { title: 'سایر قابلیت‌ها', subtitle:'دارای چراغ RGB' },
                            { title: 'نوع اتصال', subtitle: 'باسیم' },
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle: 'مقاوم در برابر گرد و غبار' },
                     ],
                     questions: [
                            'چرا داخل لپتاپ ظرفیتش رو ۱.۸۱ نشون میده نه ۲ ترا طبیعیه؟',
                            'سلام کی رنگ سیاه رو موجود میکنید؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'هارد اکسترنال',
                     ],
              },
              {
                     id: 3,
                       cardName:'هارد اکسترنال ای دیتا مدل HD710 Pro ظرفیت 2 ترابایت',
                     name: 'هارد اکسترنال ای دیتا مدل HD710 Pro ظرفیت 2 ترابایت',

                     price: 3750000,
                     rate: 4.3,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'سه سال پیش یه ترابایتشو خریدم الانم دو ترابایتشو گرفتم خیلی راضیم پیشنهاد میشه',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:false},
                            {title:'قرمز',subTitle:'red',ordered:true},
                            {title:'آبی',subTitle:'lightskyblue',ordered:false},
                            {title:'زرد',subTitle:'yellow',ordered:false},
                     ],
                     propertys: [
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle:'مقاوم در برابر گرد و غبار' },
                            
                     ],
                     moreInfo: {
                            title: 'هارد اکسترنال',
                            text: 'با استفاده از HD770G می توانید تمام بازی ها و اطلاعات خود را ذخیره کنید. علاوه بر این HD770G دارای استاندارد IP68 و این بدان معناست که نه تنها دارای بدنه سه لایه مقاوم است بلکه در برابر آب، گرد و غبار و شوک هم مقاوم است. از یک هارد اکسترنال نمی توان انتظاری بیش از این داشت (استاندارد IP68 به معنی مقاومت در برابر ورود گرد و غبار و مایعات به درون هارد دیسک است). HD770G حتی فراتر از استانداردهای IP68 از اطلاعات شما در برابر آب و گرد و غبار محافظت می کند. به صورت خاص می تواند 120 دقیقه در عمق 2 متری آب مقاومت کند. HD770G طوری طراحی شده است که مانند یک جنگجو سخت باشد! با رعایت استاندارد MIL-STD-810G 516.6 ، این هارددیسک اکسترنال می تواند از سقوط های ناگهانی از ارتفاع 1.22 متر جان سالم به در ببرد و از اطلاعات ذخیره شده محافظت کند. می توانید فضای ذخیره سازی محدود روی کنسول های بازی خود را، با استفاده از HD770G و فضای زیاد برای ذخیره سازی بازی های خود جبران کنید. این هارد اکسترنال نه تنها برای بازی های کنسولی بسیار کارآمد است بلکه برای بازی های کامپیوتری هم گزینه بسیار مناسبی است. برخلاف درپوش هاردهای اکسترنال دیگر که به زحمت بسته می شوند درپوش HD770G به راحتی بسته می شود و از دستگاه در برابر نفود آب محافظت می کند. هارد دیسک های اکسترنال جدید HD770G، طراحی بسیار زیبایی دارند که به این سادگی نمی توانید از آنها عبور کنید. بر روی هارد دیسک نوارهای LED RGB نصب شده است که زیبایی آنها را دو چندان می کند. البته HD770G با رمز گذاری 256 بیتی AES طراحی شده اند که حفاظت از داده ها را بهبود می بخشد. هرآنچه که بخواهید، در خانواده HD770G خواهید یافت'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۲۷۰ گرم' },
                            { title: 'سایر قابلیت‌ها', subtitle:'دارای چراغ RGB' },
                            { title: 'نوع اتصال', subtitle: 'باسیم' },
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle: 'مقاوم در برابر گرد و غبار' },
                     ],
                     questions: [
                            'چرا داخل لپتاپ ظرفیتش رو ۱.۸۱ نشون میده نه ۲ ترا طبیعیه؟',
                            'سلام کی رنگ سیاه رو موجود میکنید؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'هارد اکسترنال',
                     ],
              },
              {
                     id: 4,
                       cardName:'هارد اکسترنال سیلیکون پاور مدل Armor A30 ظرفیت 1 ترابایت',
                     name: 'هارد اکسترنال سیلیکون پاور مدل Armor A30 ظرفیت 1 ترابایت',

                     price: 2650000,
                     rate: 4.2,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'سه سال پیش یه ترابایتشو خریدم الانم دو ترابایتشو گرفتم خیلی راضیم پیشنهاد میشه',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'سفید',subTitle:'white',ordered:false},
                            {title:'مشکی',subTitle:'black',ordered:true},
                       
                     ],
                     propertys: [
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle:'مقاوم در برابر گرد و غبار' },
                            
                     ],
                     moreInfo: {
                            title: 'هارد اکسترنال',
                            text: 'با استفاده از HD770G می توانید تمام بازی ها و اطلاعات خود را ذخیره کنید. علاوه بر این HD770G دارای استاندارد IP68 و این بدان معناست که نه تنها دارای بدنه سه لایه مقاوم است بلکه در برابر آب، گرد و غبار و شوک هم مقاوم است. از یک هارد اکسترنال نمی توان انتظاری بیش از این داشت (استاندارد IP68 به معنی مقاومت در برابر ورود گرد و غبار و مایعات به درون هارد دیسک است). HD770G حتی فراتر از استانداردهای IP68 از اطلاعات شما در برابر آب و گرد و غبار محافظت می کند. به صورت خاص می تواند 120 دقیقه در عمق 2 متری آب مقاومت کند. HD770G طوری طراحی شده است که مانند یک جنگجو سخت باشد! با رعایت استاندارد MIL-STD-810G 516.6 ، این هارددیسک اکسترنال می تواند از سقوط های ناگهانی از ارتفاع 1.22 متر جان سالم به در ببرد و از اطلاعات ذخیره شده محافظت کند. می توانید فضای ذخیره سازی محدود روی کنسول های بازی خود را، با استفاده از HD770G و فضای زیاد برای ذخیره سازی بازی های خود جبران کنید. این هارد اکسترنال نه تنها برای بازی های کنسولی بسیار کارآمد است بلکه برای بازی های کامپیوتری هم گزینه بسیار مناسبی است. برخلاف درپوش هاردهای اکسترنال دیگر که به زحمت بسته می شوند درپوش HD770G به راحتی بسته می شود و از دستگاه در برابر نفود آب محافظت می کند. هارد دیسک های اکسترنال جدید HD770G، طراحی بسیار زیبایی دارند که به این سادگی نمی توانید از آنها عبور کنید. بر روی هارد دیسک نوارهای LED RGB نصب شده است که زیبایی آنها را دو چندان می کند. البته HD770G با رمز گذاری 256 بیتی AES طراحی شده اند که حفاظت از داده ها را بهبود می بخشد. هرآنچه که بخواهید، در خانواده HD770G خواهید یافت'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۲۷۰ گرم' },
                            { title: 'سایر قابلیت‌ها', subtitle:'دارای چراغ RGB' },
                            { title: 'نوع اتصال', subtitle: 'باسیم' },
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle: 'مقاوم در برابر گرد و غبار' },
                     ],
                     questions: [
                            'چرا داخل لپتاپ ظرفیتش رو ۱.۸۱ نشون میده نه ۲ ترا طبیعیه؟',
                            'سلام کی رنگ سیاه رو موجود میکنید؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'هارد اکسترنال',
                     ],
              },
              {
                     id: 5,
                       cardName:'هارد اکسترنال توشیبا مدل Canvio ‌‌Basics ظرفیت 4 ترابایت',
                     name: 'هارد اکسترنال توشیبا مدل Canvio ‌‌Basics ظرفیت 4 ترابایت',

                     price: 4130000,
                     rate: 4.3,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'سه سال پیش یه ترابایتشو خریدم الانم دو ترابایتشو گرفتم خیلی راضیم پیشنهاد میشه',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:true},
                            
                     ],
                     propertys: [
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle:'مقاوم در برابر گرد و غبار' },
                            
                     ],
                     moreInfo: {
                            title: 'هارد اکسترنال',
                            text: 'با استفاده از HD770G می توانید تمام بازی ها و اطلاعات خود را ذخیره کنید. علاوه بر این HD770G دارای استاندارد IP68 و این بدان معناست که نه تنها دارای بدنه سه لایه مقاوم است بلکه در برابر آب، گرد و غبار و شوک هم مقاوم است. از یک هارد اکسترنال نمی توان انتظاری بیش از این داشت (استاندارد IP68 به معنی مقاومت در برابر ورود گرد و غبار و مایعات به درون هارد دیسک است). HD770G حتی فراتر از استانداردهای IP68 از اطلاعات شما در برابر آب و گرد و غبار محافظت می کند. به صورت خاص می تواند 120 دقیقه در عمق 2 متری آب مقاومت کند. HD770G طوری طراحی شده است که مانند یک جنگجو سخت باشد! با رعایت استاندارد MIL-STD-810G 516.6 ، این هارددیسک اکسترنال می تواند از سقوط های ناگهانی از ارتفاع 1.22 متر جان سالم به در ببرد و از اطلاعات ذخیره شده محافظت کند. می توانید فضای ذخیره سازی محدود روی کنسول های بازی خود را، با استفاده از HD770G و فضای زیاد برای ذخیره سازی بازی های خود جبران کنید. این هارد اکسترنال نه تنها برای بازی های کنسولی بسیار کارآمد است بلکه برای بازی های کامپیوتری هم گزینه بسیار مناسبی است. برخلاف درپوش هاردهای اکسترنال دیگر که به زحمت بسته می شوند درپوش HD770G به راحتی بسته می شود و از دستگاه در برابر نفود آب محافظت می کند. هارد دیسک های اکسترنال جدید HD770G، طراحی بسیار زیبایی دارند که به این سادگی نمی توانید از آنها عبور کنید. بر روی هارد دیسک نوارهای LED RGB نصب شده است که زیبایی آنها را دو چندان می کند. البته HD770G با رمز گذاری 256 بیتی AES طراحی شده اند که حفاظت از داده ها را بهبود می بخشد. هرآنچه که بخواهید، در خانواده HD770G خواهید یافت'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۲۷۰ گرم' },
                            { title: 'سایر قابلیت‌ها', subtitle:'دارای چراغ RGB' },
                            { title: 'نوع اتصال', subtitle: 'باسیم' },
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle: 'مقاوم در برابر گرد و غبار' },
                     ],
                     questions: [
                            'چرا داخل لپتاپ ظرفیتش رو ۱.۸۱ نشون میده نه ۲ ترا طبیعیه؟',
                            'سلام کی رنگ سیاه رو موجود میکنید؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'هارد اکسترنال',
                     ],
                    
              },
              {
                     id: 6,
                       cardName:'هارددیسک اکسترنال وسترن دیجیتال مدل My Book Desktop ظرفیت 4 ترابایت',
                     name: 'هارددیسک اکسترنال وسترن دیجیتال مدل My Book Desktop ظرفیت 4 ترابایت',

                     price: 5570000,
                     rate: 4.2,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'سه سال پیش یه ترابایتشو خریدم الانم دو ترابایتشو گرفتم خیلی راضیم پیشنهاد میشه',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:true},         
                     ],
                     propertys: [
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle:'مقاوم در برابر گرد و غبار' },
                            
                     ],
                     moreInfo: {
                            title: 'هارد اکسترنال',
                            text: 'با استفاده از HD770G می توانید تمام بازی ها و اطلاعات خود را ذخیره کنید. علاوه بر این HD770G دارای استاندارد IP68 و این بدان معناست که نه تنها دارای بدنه سه لایه مقاوم است بلکه در برابر آب، گرد و غبار و شوک هم مقاوم است. از یک هارد اکسترنال نمی توان انتظاری بیش از این داشت (استاندارد IP68 به معنی مقاومت در برابر ورود گرد و غبار و مایعات به درون هارد دیسک است). HD770G حتی فراتر از استانداردهای IP68 از اطلاعات شما در برابر آب و گرد و غبار محافظت می کند. به صورت خاص می تواند 120 دقیقه در عمق 2 متری آب مقاومت کند. HD770G طوری طراحی شده است که مانند یک جنگجو سخت باشد! با رعایت استاندارد MIL-STD-810G 516.6 ، این هارددیسک اکسترنال می تواند از سقوط های ناگهانی از ارتفاع 1.22 متر جان سالم به در ببرد و از اطلاعات ذخیره شده محافظت کند. می توانید فضای ذخیره سازی محدود روی کنسول های بازی خود را، با استفاده از HD770G و فضای زیاد برای ذخیره سازی بازی های خود جبران کنید. این هارد اکسترنال نه تنها برای بازی های کنسولی بسیار کارآمد است بلکه برای بازی های کامپیوتری هم گزینه بسیار مناسبی است. برخلاف درپوش هاردهای اکسترنال دیگر که به زحمت بسته می شوند درپوش HD770G به راحتی بسته می شود و از دستگاه در برابر نفود آب محافظت می کند. هارد دیسک های اکسترنال جدید HD770G، طراحی بسیار زیبایی دارند که به این سادگی نمی توانید از آنها عبور کنید. بر روی هارد دیسک نوارهای LED RGB نصب شده است که زیبایی آنها را دو چندان می کند. البته HD770G با رمز گذاری 256 بیتی AES طراحی شده اند که حفاظت از داده ها را بهبود می بخشد. هرآنچه که بخواهید، در خانواده HD770G خواهید یافت'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۲۷۰ گرم' },
                            { title: 'سایر قابلیت‌ها', subtitle:'دارای چراغ RGB' },
                            { title: 'نوع اتصال', subtitle: 'باسیم' },
                            { title: 'ظرفیت', subtitle: 'دو ترابایت' },
                            { title: 'قابلیت‌های مقاومتی', subtitle: 'مقاوم در برابر گرد و غبار' },
                     ],
                     questions: [
                            'چرا داخل لپتاپ ظرفیتش رو ۱.۸۱ نشون میده نه ۲ ترا طبیعیه؟',
                            'سلام کی رنگ سیاه رو موجود میکنید؟',
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'هارد اکسترنال',
                     ],
              },
       ],
       mouseAndKeyboard: [
              {
                     id: 1,
                     cardName:'موس بی‌سیم اپل مدل Magic Mouse 2',
                     name: 'موس بی‌سیم اپل مدل Magic Mouse 2',

                     price: 4550000,
                     rate: 4.3,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'عالی',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'سفید',subTitle:'white',ordered:true},
                     ],
                     propertys: [
                            { title: 'نوع رابط', subtitle: 'USB' },
                            { title: 'نوع حسگر ', subtitle:'لیزری' },
                            { title: 'محدوده دقت', subtitle:'800 تا 1600' },
                            { title: 'تعداد باتری', subtitle:'یک عدد' },
                            { title: 'نوع و سایز باتری', subtitle:'باتری لیتیوم-یونی' },
                            
                     ],
                     moreInfo: {
                            title: 'موس',
                            text: 'اگر حتی از کاربران اپل نیز نباشید مطمئنا اسم مجیک ماوس اپل به گوشتان خورده است. ماوسی که انقلابی در لوازم جانبی به حساب می‌آید. ماوس اپل ظاهری بسیار ساده و شفاف داشته .تکنولوژی Multi-Touch همانند نسل قبلی در این ماوس نیز موجود است. وجود این قابلیت شما را قادر می‌کند با تکان دادن انگشتانتان بر روی ماوس روی صفحات مختلف حرکت کنید. برای متصل شدن به ماوس از طریق رایانه خود نیاز به سیستم‌عامل جدید اپل OS X El Capitan و فناوری بلوتوث دارید. در سیستم‌عامل جدید مشکل شناخته نشدن ماوس حذف شده است.پس به راحتی به رایانه خود وصل می‌شوید و از تجربه جدید خود لذت برده. این نسخه جدید نیز همانند محصولات قبلی دارای مزایایی است که شما را برای برقراری هر چه بهتر با رایانه شخصی‌تان ترغیب می‌کند. ارگونومی خوب، جای گیری راحت در زیر دستانتنان، تکنولوژی‌های برقرای ارتباط مثل قابلیت Multi-Touch و حذف برخی از ویژگی‌ها مثل باطری به بهتر شدن نحوه ارتباط تاثیر به سزایی گذاشته است.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۹۹ گرم' },
                            { title: 'ابعاد', subtitle:'۲۱.۶ × ۲۲.۵ × ۴۴.۷ میلی‌متر'},
                            { title: 'نوع اتصال', subtitle: 'بی‌سیم' },
                            { title: 'تعداد کلید', subtitle: 'دو عدد' },
                            { title: 'قابلیت‌های ماوس', subtitle: 'کلید روشن و خاموش' },
                     ],
                     questions: [
                            'تفاوت این مدل با مدل Magic Mouse MMMQ3ZM/A چیه؟ کدوم بهتره؟',
                           'سلام نسل ٢٠٢١ هست؟! و اينكه رابطش taype c هست؟! ',
                           'با Bluetooth متصل میشه یا دانگل USB داره ¿'
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'موس',
                     ],
                     link: 'https://www.digikala.com/product/dkp-109563/%D9%85%D9%88%D8%B3-%D8%A8%DB%8C%D8%B3%DB%8C%D9%85-%D8%A7%D9%BE%D9%84-%D9%85%D8%AF%D9%84-magic-mouse-2/#'
              },
              {
                     id: 2,
                       cardName:'ماوس مخصوص بازی ایفورتک مدل V8M',
                     name: 'ماوس مخصوص بازی ایفورتک مدل V8M',

                     price:1555000,
                     rate: 4.5,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'عالی',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:true},
                     ],
                     propertys: [
                            { title: 'نوع رابط', subtitle: 'USB' },
                            { title: 'نوع حسگر ', subtitle:'لیزری' },
                            { title: 'محدوده دقت', subtitle:'800 تا 1600' },
                            { title: 'تعداد باتری', subtitle:'یک عدد' },
                            { title: 'نوع و سایز باتری', subtitle:'باتری لیتیوم-یونی' },
                            
                     ],
                     moreInfo: {
                            title: 'موس',
                            text: 'اگر حتی از کاربران اپل نیز نباشید مطمئنا اسم مجیک ماوس اپل به گوشتان خورده است. ماوسی که انقلابی در لوازم جانبی به حساب می‌آید. ماوس اپل ظاهری بسیار ساده و شفاف داشته .تکنولوژی Multi-Touch همانند نسل قبلی در این ماوس نیز موجود است. وجود این قابلیت شما را قادر می‌کند با تکان دادن انگشتانتان بر روی ماوس روی صفحات مختلف حرکت کنید. برای متصل شدن به ماوس از طریق رایانه خود نیاز به سیستم‌عامل جدید اپل OS X El Capitan و فناوری بلوتوث دارید. در سیستم‌عامل جدید مشکل شناخته نشدن ماوس حذف شده است.پس به راحتی به رایانه خود وصل می‌شوید و از تجربه جدید خود لذت برده. این نسخه جدید نیز همانند محصولات قبلی دارای مزایایی است که شما را برای برقراری هر چه بهتر با رایانه شخصی‌تان ترغیب می‌کند. ارگونومی خوب، جای گیری راحت در زیر دستانتنان، تکنولوژی‌های برقرای ارتباط مثل قابلیت Multi-Touch و حذف برخی از ویژگی‌ها مثل باطری به بهتر شدن نحوه ارتباط تاثیر به سزایی گذاشته است.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۹۹ گرم' },
                            { title: 'ابعاد', subtitle:'۲۱.۶ × ۲۲.۵ × ۴۴.۷ میلی‌متر'},
                            { title: 'نوع اتصال', subtitle: 'بی‌سیم' },
                            { title: 'تعداد کلید', subtitle: 'دو عدد' },
                            { title: 'قابلیت‌های ماوس', subtitle: 'کلید روشن و خاموش' },
                     ],
                     questions: [
                            'تفاوت این مدل با مدل Magic Mouse MMMQ3ZM/A چیه؟ کدوم بهتره؟',
                           'سلام نسل ٢٠٢١ هست؟! و اينكه رابطش taype c هست؟! ',
                           'با Bluetooth متصل میشه یا دانگل USB داره ¿'
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'موس',
                     ],
              },
              {
                     id: 3,
                       cardName:'ماوس مخصوص بازی لاجیتک مدل G402 Hyperion Fury',
                     name: 'ماوس مخصوص بازی لاجیتک مدل G402 Hyperion Fury',

                     price: 2840000,
                     rate: 4.4,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'عالی',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:true},

                     ],
                     propertys: [
                            { title: 'نوع رابط', subtitle: 'USB' },
                            { title: 'نوع حسگر ', subtitle:'لیزری' },
                            { title: 'محدوده دقت', subtitle:'800 تا 1600' },
                            { title: 'تعداد باتری', subtitle:'یک عدد' },
                            { title: 'نوع و سایز باتری', subtitle:'باتری لیتیوم-یونی' },
                            
                     ],
                     moreInfo: {
                            title: 'موس',
                            text: 'اگر حتی از کاربران اپل نیز نباشید مطمئنا اسم مجیک ماوس اپل به گوشتان خورده است. ماوسی که انقلابی در لوازم جانبی به حساب می‌آید. ماوس اپل ظاهری بسیار ساده و شفاف داشته .تکنولوژی Multi-Touch همانند نسل قبلی در این ماوس نیز موجود است. وجود این قابلیت شما را قادر می‌کند با تکان دادن انگشتانتان بر روی ماوس روی صفحات مختلف حرکت کنید. برای متصل شدن به ماوس از طریق رایانه خود نیاز به سیستم‌عامل جدید اپل OS X El Capitan و فناوری بلوتوث دارید. در سیستم‌عامل جدید مشکل شناخته نشدن ماوس حذف شده است.پس به راحتی به رایانه خود وصل می‌شوید و از تجربه جدید خود لذت برده. این نسخه جدید نیز همانند محصولات قبلی دارای مزایایی است که شما را برای برقراری هر چه بهتر با رایانه شخصی‌تان ترغیب می‌کند. ارگونومی خوب، جای گیری راحت در زیر دستانتنان، تکنولوژی‌های برقرای ارتباط مثل قابلیت Multi-Touch و حذف برخی از ویژگی‌ها مثل باطری به بهتر شدن نحوه ارتباط تاثیر به سزایی گذاشته است.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۹۹ گرم' },
                            { title: 'ابعاد', subtitle:'۲۱.۶ × ۲۲.۵ × ۴۴.۷ میلی‌متر'},
                            { title: 'نوع اتصال', subtitle: 'بی‌سیم' },
                            { title: 'تعداد کلید', subtitle: 'دو عدد' },
                            { title: 'قابلیت‌های ماوس', subtitle: 'کلید روشن و خاموش' },
                     ],
                     questions: [
                            'تفاوت این مدل با مدل Magic Mouse MMMQ3ZM/A چیه؟ کدوم بهتره؟',
                           'سلام نسل ٢٠٢١ هست؟! و اينكه رابطش taype c هست؟! ',
                           'با Bluetooth متصل میشه یا دانگل USB داره ¿'
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'موس',
                     ],
              },
              {
                     id: 4,
                       cardName:'کیبورد مخصوص بازی کورسیر مدل K100 RGB optical-mechanical',
                     name: 'کیبورد مخصوص بازی کورسیر مدل K100 RGB optical-mechanical',

                     price: 24550000,
                     rate: 5,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'عالی',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:false},
                            {title:'قرمز',subTitle:'red',ordered:true},
                     ],
                     propertys: [
                            { title: 'نوع رابط', subtitle: 'USB' },
                            { title: 'نوع حسگر ', subtitle:'لیزری' },
                            { title: 'محدوده دقت', subtitle:'800 تا 1600' },
                            { title: 'تعداد باتری', subtitle:'یک عدد' },
                            { title: 'نوع و سایز باتری', subtitle:'باتری لیتیوم-یونی' },
                            
                     ],
                     moreInfo: {
                            title: 'کیبورد',
                            text: 'اگر حتی از کاربران اپل نیز نباشید مطمئنا اسم مجیک ماوس اپل به گوشتان خورده است. ماوسی که انقلابی در لوازم جانبی به حساب می‌آید. ماوس اپل ظاهری بسیار ساده و شفاف داشته .تکنولوژی Multi-Touch همانند نسل قبلی در این ماوس نیز موجود است. وجود این قابلیت شما را قادر می‌کند با تکان دادن انگشتانتان بر روی ماوس روی صفحات مختلف حرکت کنید. برای متصل شدن به ماوس از طریق رایانه خود نیاز به سیستم‌عامل جدید اپل OS X El Capitan و فناوری بلوتوث دارید. در سیستم‌عامل جدید مشکل شناخته نشدن ماوس حذف شده است.پس به راحتی به رایانه خود وصل می‌شوید و از تجربه جدید خود لذت برده. این نسخه جدید نیز همانند محصولات قبلی دارای مزایایی است که شما را برای برقراری هر چه بهتر با رایانه شخصی‌تان ترغیب می‌کند. ارگونومی خوب، جای گیری راحت در زیر دستانتنان، تکنولوژی‌های برقرای ارتباط مثل قابلیت Multi-Touch و حذف برخی از ویژگی‌ها مثل باطری به بهتر شدن نحوه ارتباط تاثیر به سزایی گذاشته است.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۹۹ گرم' },
                            { title: 'ابعاد', subtitle:'۲۱.۶ × ۲۲.۵ × ۴۴.۷ میلی‌متر'},
                            { title: 'نوع اتصال', subtitle: 'بی‌سیم' },
                            { title: 'تعداد کلید', subtitle: 'دو عدد' },
                            { title: 'قابلیت‌های ماوس', subtitle: 'کلید روشن و خاموش' },
                     ],
                     questions: [
                            'تفاوت این مدل با مدل Magic Mouse MMMQ3ZM/A چیه؟ کدوم بهتره؟',
                           'سلام نسل ٢٠٢١ هست؟! و اينكه رابطش taype c هست؟! ',
                           'با Bluetooth متصل میشه یا دانگل USB داره ¿'
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'کیبورد',
                     ],
              },
              {
                     id: 5,
                       cardName:'کیبورد بی سیم مدل I8 Backlit',
                     name: 'کیبورد بی سیم مدل I8 Backlit',

                     price: 298000,
                     rate: 4,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'عالی',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:true},
                     ],
                     propertys: [
                            { title: 'نوع رابط', subtitle: 'USB' },
                            { title: 'نوع حسگر ', subtitle:'لیزری' },
                            { title: 'محدوده دقت', subtitle:'800 تا 1600' },
                            { title: 'تعداد باتری', subtitle:'یک عدد' },
                            { title: 'نوع و سایز باتری', subtitle:'باتری لیتیوم-یونی' },
                            
                     ],
                     moreInfo: {
                            title: 'کیبورد',
                            text: 'اگر حتی از کاربران اپل نیز نباشید مطمئنا اسم مجیک ماوس اپل به گوشتان خورده است. ماوسی که انقلابی در لوازم جانبی به حساب می‌آید. ماوس اپل ظاهری بسیار ساده و شفاف داشته .تکنولوژی Multi-Touch همانند نسل قبلی در این ماوس نیز موجود است. وجود این قابلیت شما را قادر می‌کند با تکان دادن انگشتانتان بر روی ماوس روی صفحات مختلف حرکت کنید. برای متصل شدن به ماوس از طریق رایانه خود نیاز به سیستم‌عامل جدید اپل OS X El Capitan و فناوری بلوتوث دارید. در سیستم‌عامل جدید مشکل شناخته نشدن ماوس حذف شده است.پس به راحتی به رایانه خود وصل می‌شوید و از تجربه جدید خود لذت برده. این نسخه جدید نیز همانند محصولات قبلی دارای مزایایی است که شما را برای برقراری هر چه بهتر با رایانه شخصی‌تان ترغیب می‌کند. ارگونومی خوب، جای گیری راحت در زیر دستانتنان، تکنولوژی‌های برقرای ارتباط مثل قابلیت Multi-Touch و حذف برخی از ویژگی‌ها مثل باطری به بهتر شدن نحوه ارتباط تاثیر به سزایی گذاشته است.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۹۹ گرم' },
                            { title: 'ابعاد', subtitle:'۲۱.۶ × ۲۲.۵ × ۴۴.۷ میلی‌متر'},
                            { title: 'نوع اتصال', subtitle: 'بی‌سیم' },
                            { title: 'تعداد کلید', subtitle: 'دو عدد' },
                            { title: 'قابلیت‌های ماوس', subtitle: 'کلید روشن و خاموش' },
                     ],
                     questions: [
                            'تفاوت این مدل با مدل Magic Mouse MMMQ3ZM/A چیه؟ کدوم بهتره؟',
                           'سلام نسل ٢٠٢١ هست؟! و اينكه رابطش taype c هست؟! ',
                           'با Bluetooth متصل میشه یا دانگل USB داره ¿'
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'کیبورد',
                     ],
              },
              {
                     id: 6,
                     cardName:'کیبورد مخصوص بازی پرودو مدل pdx212',
                     name: 'کیبورد مخصوص بازی پرودو مدل pdx212',

                     price: 839000,
                     rate: 3.8,
                     comments: [
                            {
                                   title: 'کیفیتش خدایی خوبه',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'به نظرم توی این رنج قیمت مناسب ترینه علاوه بر این زیبا و شیک هم هست',

                                   rate: 5
                            }
                            ,
                            {
                                   title: 'عالی',
                                   rate: 5
                            }

                     ],
                     colors:[
                            {title:'مشکی',subTitle:'black',ordered:true},
                     ],
                     propertys: [
                            { title: 'نوع رابط', subtitle: 'USB' },
                            { title: 'نوع حسگر ', subtitle:'لیزری' },
                            { title: 'محدوده دقت', subtitle:'800 تا 1600' },
                            { title: 'تعداد باتری', subtitle:'یک عدد' },
                            { title: 'نوع و سایز باتری', subtitle:'باتری لیتیوم-یونی' },
                            
                     ],
                     moreInfo: {
                            title: 'کیبورد',
                            text: 'اگر حتی از کاربران اپل نیز نباشید مطمئنا اسم مجیک ماوس اپل به گوشتان خورده است. ماوسی که انقلابی در لوازم جانبی به حساب می‌آید. ماوس اپل ظاهری بسیار ساده و شفاف داشته .تکنولوژی Multi-Touch همانند نسل قبلی در این ماوس نیز موجود است. وجود این قابلیت شما را قادر می‌کند با تکان دادن انگشتانتان بر روی ماوس روی صفحات مختلف حرکت کنید. برای متصل شدن به ماوس از طریق رایانه خود نیاز به سیستم‌عامل جدید اپل OS X El Capitan و فناوری بلوتوث دارید. در سیستم‌عامل جدید مشکل شناخته نشدن ماوس حذف شده است.پس به راحتی به رایانه خود وصل می‌شوید و از تجربه جدید خود لذت برده. این نسخه جدید نیز همانند محصولات قبلی دارای مزایایی است که شما را برای برقراری هر چه بهتر با رایانه شخصی‌تان ترغیب می‌کند. ارگونومی خوب، جای گیری راحت در زیر دستانتنان، تکنولوژی‌های برقرای ارتباط مثل قابلیت Multi-Touch و حذف برخی از ویژگی‌ها مثل باطری به بهتر شدن نحوه ارتباط تاثیر به سزایی گذاشته است.'
                     },
                     Specifications: [
                            { title: 'وزن', subtitle: '۹۹ گرم' },
                            { title: 'ابعاد', subtitle:'۲۱.۶ × ۲۲.۵ × ۴۴.۷ میلی‌متر'},
                            { title: 'نوع اتصال', subtitle: 'بی‌سیم' },
                            { title: 'تعداد کلید', subtitle: 'دو عدد' },
                            { title: 'قابلیت‌های ماوس', subtitle: 'کلید روشن و خاموش' },
                     ],
                     questions: [
                            'تفاوت این مدل با مدل Magic Mouse MMMQ3ZM/A چیه؟ کدوم بهتره؟',
                           'سلام نسل ٢٠٢١ هست؟! و اينكه رابطش taype c هست؟! ',
                           'با Bluetooth متصل میشه یا دانگل USB داره ¿'
                     ],
                     breadCrumb: [
                            'راد کالا',
                            'کیبورد',
                     ],
              },
       ],
       consule: [
              {
                     id: 1,
                     link: 'https://www.digikala.com/product/dkp-1631190/%DA%A9%D9%86%D8%B3%D9%88%D9%84-%D8%A8%D8%A7%D8%B2%DB%8C-%D8%B3%D9%88%D9%86%DB%8C-%D9%85%D8%AF%D9%84-playstation-4-slim-%D8%B1%DB%8C%D8%AC%D9%86-3-%DA%A9%D8%AF-cuh-2218b-%D8%B8%D8%B1%D9%81%DB%8C%D8%AA-1-%D8%AA%D8%B1%D8%A7%D8%A8%D8%A7%DB%8C%D8%AA/#'
              },
              {
                     id: 2,
                     link: 'https://www.digikala.com/product/dkp-10475384/%DA%A9%D9%86%D8%B3%D9%88%D9%84-%D8%A8%D8%A7%D8%B2%DB%8C-%D8%B3%D9%88%D9%86%DB%8C-%D9%85%D8%AF%D9%84-playstation-5-%D8%B3%D8%B1%DB%8C-1216a-%D8%B8%D8%B1%D9%81%DB%8C%D8%AA-825-%DA%AF%DB%8C%DA%AF%D8%A7%D8%A8%D8%A7%DB%8C%D8%AA/#'
              },
              {
                     id: 3,
                     link: 'https://www.digikala.com/product/dkp-4033272/%D8%AF%D8%B3%D8%AA%D9%87-%D8%A8%D8%A7%D8%B2%DB%8C-%D9%BE%D9%84%DB%8C-%D8%A7%D8%B3%D8%AA%DB%8C%D8%B4%D9%86-5-%D8%B3%D9%88%D9%86%DB%8C-%D9%85%D8%AF%D9%84-dualsense-cfi-zct1w/'
              },
              {
                     id: 4,
                     link: 'https://www.digikala.com/product/dkp-3738743/%DA%A9%D9%86%D8%B3%D9%88%D9%84-%D8%A8%D8%A7%D8%B2%DB%8C-%D9%85%D8%A7%DB%8C%DA%A9%D8%B1%D9%88%D8%B3%D8%A7%D9%81%D8%AA-%D9%85%D8%AF%D9%84-xbox-series-x-%D8%B8%D8%B1%D9%81%DB%8C%D8%AA-1-%D8%AA%D8%B1%D8%A7%D8%A8%D8%A7%DB%8C%D8%AA/#gallery'
              },
       ],
       smartWatches: [
              {
                     id: 1,
                     link: 'https://www.digikala.com/product/dkp-9424170/%D8%B3%D8%A7%D8%B9%D8%AA-%D9%87%D9%88%D8%B4%D9%85%D9%86%D8%AF-%D8%A7%D9%BE%D9%84-%D9%88%D8%A7%DA%86-%D9%85%D8%AF%D9%84-ultra-49-mm-alpine-loop/#gallery'
              },
              {
                     id: 2,
                     link: 'https://www.digikala.com/product/dkp-7380557/%D8%B3%D8%A7%D8%B9%D8%AA-%D9%87%D9%88%D8%B4%D9%85%D9%86%D8%AF-%D8%B4%DB%8C%D8%A7%D8%A6%D9%88%D9%85%DB%8C-%D9%85%D8%AF%D9%84-redmi-watch-2-lite-%D8%A8%D9%86%D8%AF-%D8%B3%D9%84%DB%8C%DA%A9%D9%88%D9%86%DB%8C/#gallery'
              },
              {
                     id: 3,
                     link: 'https://www.digikala.com/product/dkp-12212677/%D8%B3%D8%A7%D8%B9%D8%AA-%D9%87%D9%88%D8%B4%D9%85%D9%86%D8%AF-%D8%B3%D8%A7%D9%85%D8%B3%D9%88%D9%86%DA%AF-%D9%85%D8%AF%D9%84-galaxy-watch6-classic-43mm-clone-1-of-12212645/#'
              },
              {
                     id: 4,
                     link: 'https://www.digikala.com/product/dkp-9422706/%D8%B3%D8%A7%D8%B9%D8%AA-%D9%87%D9%88%D8%B4%D9%85%D9%86%D8%AF-%D8%A7%D9%BE%D9%84-%D9%85%D8%AF%D9%84-series-8-aluminum-45mm/#'
              },
              {
                     id: 5,
                     link: 'https://www.digikala.com/product/dkp-9269728/%D8%B3%D8%A7%D8%B9%D8%AA-%D9%87%D9%88%D8%B4%D9%85%D9%86%D8%AF-%D8%B3%D8%A7%D9%85%D8%B3%D9%88%D9%86%DA%AF-%D9%85%D8%AF%D9%84-galaxy-watch5-44mm/#'
              },
       ],
       camera: [
              {
                     id: 1,
                     link: 'https://www.digikala.com/product/dkp-2146239/%D8%AF%D9%88%D8%B1%D8%A8%DB%8C%D9%86-%D8%AF%DB%8C%D8%AC%DB%8C%D8%AA%D8%A7%D9%84-%DA%A9%D8%A7%D9%86%D9%86-%D9%85%D8%AF%D9%84-eos-90d-%D8%A8%D9%87-%D9%87%D9%85%D8%B1%D8%A7%D9%87-%D9%84%D9%86%D8%B2-135-18-%D9%85%DB%8C%D9%84%DB%8C-%D9%85%D8%AA%D8%B1-is-usm/#gallery'
              },
              {
                     id: 2,
                     link: 'https://www.digikala.com/product/dkp-3536676/%D8%AF%D9%88%D8%B1%D8%A8%DB%8C%D9%86-%D8%AF%DB%8C%D8%AC%DB%8C%D8%AA%D8%A7%D9%84-%DA%A9%D8%A7%D9%86%D9%86-%D9%85%D8%AF%D9%84-eos-850d-%D8%A8%D9%87-%D9%87%D9%85%D8%B1%D8%A7%D9%87-%D9%84%D9%86%D8%B2-55-18-%D9%85%DB%8C%D9%84%DB%8C-%D9%85%D8%AA%D8%B1-is-stm/#gallery'
              },
              {
                     id: 3,
                     link: 'https://www.digikala.com/product/dkp-1886115/%D8%AF%D9%88%D8%B1%D8%A8%DB%8C%D9%86-%D8%AF%DB%8C%D8%AC%DB%8C%D8%AA%D8%A7%D9%84-%D8%A8%D8%AF%D9%88%D9%86-%D8%A2%DB%8C%D9%86%D9%87-%D8%B3%D9%88%D9%86%DB%8C-%D9%85%D8%AF%D9%84-alpha-a6400-%D8%A8%D9%87-%D9%87%D9%85%D8%B1%D8%A7%D9%87-%D9%84%D9%86%D8%B2-16-50-%D9%85%DB%8C%D9%84%DB%8C-%D9%85%D8%AA%D8%B1-oss/#gallery'
              },
              {
                     id: 4,
                     link: 'https://www.digikala.com/product/dkp-11627619/%D8%AF%D9%88%D8%B1%D8%A8%DB%8C%D9%86-%D8%AF%DB%8C%D8%AC%DB%8C%D8%AA%D8%A7%D9%84-%D8%A8%D8%AF%D9%88%D9%86-%D8%A2%DB%8C%D9%86%D9%87-%DA%A9%D8%A7%D9%86%D9%86-%D9%85%D8%AF%D9%84-eos-r5-c-body/#'
              },
       ]
}



const ProductsReducer = (state = [], action) => {
       switch (action.type) {

              default: return state
       }
}

export default ProductsReducer